MikroElektronika/core_packages/PIC/XC8/def/PIC18F66J99/mcu.h
// Register: UEIE
#define UEIE UEIE
extern volatile unsigned char           UEIE                __at(0xE0F);
#ifndef _LIB_BUILD
asm("UEIE equ 0E0Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIDEE                  :1;
        unsigned CRC5EE                 :1;
        unsigned CRC16EE                :1;
        unsigned DFN8EE                 :1;
        unsigned BTOEE                  :1;
        unsigned                        :2;
        unsigned BTSEE                  :1;
    };
} UEIEbits_t;
extern volatile UEIEbits_t UEIEbits __at(0xE0F);
// bitfield macros
#define _UEIE_PIDEE_POSN                                    0x0
#define _UEIE_PIDEE_POSITION                                0x0
#define _UEIE_PIDEE_SIZE                                    0x1
#define _UEIE_PIDEE_LENGTH                                  0x1
#define _UEIE_PIDEE_MASK                                    0x1
#define _UEIE_CRC5EE_POSN                                   0x1
#define _UEIE_CRC5EE_POSITION                               0x1
#define _UEIE_CRC5EE_SIZE                                   0x1
#define _UEIE_CRC5EE_LENGTH                                 0x1
#define _UEIE_CRC5EE_MASK                                   0x2
#define _UEIE_CRC16EE_POSN                                  0x2
#define _UEIE_CRC16EE_POSITION                              0x2
#define _UEIE_CRC16EE_SIZE                                  0x1
#define _UEIE_CRC16EE_LENGTH                                0x1
#define _UEIE_CRC16EE_MASK                                  0x4
#define _UEIE_DFN8EE_POSN                                   0x3
#define _UEIE_DFN8EE_POSITION                               0x3
#define _UEIE_DFN8EE_SIZE                                   0x1
#define _UEIE_DFN8EE_LENGTH                                 0x1
#define _UEIE_DFN8EE_MASK                                   0x8
#define _UEIE_BTOEE_POSN                                    0x4
#define _UEIE_BTOEE_POSITION                                0x4
#define _UEIE_BTOEE_SIZE                                    0x1
#define _UEIE_BTOEE_LENGTH                                  0x1
#define _UEIE_BTOEE_MASK                                    0x10
#define _UEIE_BTSEE_POSN                                    0x7
#define _UEIE_BTSEE_POSITION                                0x7
#define _UEIE_BTSEE_SIZE                                    0x1
#define _UEIE_BTSEE_LENGTH                                  0x1
#define _UEIE_BTSEE_MASK                                    0x80

// Register: UIE
#define UIE UIE
extern volatile unsigned char           UIE                 __at(0xE10);
#ifndef _LIB_BUILD
asm("UIE equ 0E10h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned URSTIE                 :1;
        unsigned UERRIE                 :1;
        unsigned ACTVIE                 :1;
        unsigned TRNIE                  :1;
        unsigned IDLEIE                 :1;
        unsigned STALLIE                :1;
        unsigned SOFIE                  :1;
    };
} UIEbits_t;
extern volatile UIEbits_t UIEbits __at(0xE10);
// bitfield macros
#define _UIE_URSTIE_POSN                                    0x0
#define _UIE_URSTIE_POSITION                                0x0
#define _UIE_URSTIE_SIZE                                    0x1
#define _UIE_URSTIE_LENGTH                                  0x1
#define _UIE_URSTIE_MASK                                    0x1
#define _UIE_UERRIE_POSN                                    0x1
#define _UIE_UERRIE_POSITION                                0x1
#define _UIE_UERRIE_SIZE                                    0x1
#define _UIE_UERRIE_LENGTH                                  0x1
#define _UIE_UERRIE_MASK                                    0x2
#define _UIE_ACTVIE_POSN                                    0x2
#define _UIE_ACTVIE_POSITION                                0x2
#define _UIE_ACTVIE_SIZE                                    0x1
#define _UIE_ACTVIE_LENGTH                                  0x1
#define _UIE_ACTVIE_MASK                                    0x4
#define _UIE_TRNIE_POSN                                     0x3
#define _UIE_TRNIE_POSITION                                 0x3
#define _UIE_TRNIE_SIZE                                     0x1
#define _UIE_TRNIE_LENGTH                                   0x1
#define _UIE_TRNIE_MASK                                     0x8
#define _UIE_IDLEIE_POSN                                    0x4
#define _UIE_IDLEIE_POSITION                                0x4
#define _UIE_IDLEIE_SIZE                                    0x1
#define _UIE_IDLEIE_LENGTH                                  0x1
#define _UIE_IDLEIE_MASK                                    0x10
#define _UIE_STALLIE_POSN                                   0x5
#define _UIE_STALLIE_POSITION                               0x5
#define _UIE_STALLIE_SIZE                                   0x1
#define _UIE_STALLIE_LENGTH                                 0x1
#define _UIE_STALLIE_MASK                                   0x20
#define _UIE_SOFIE_POSN                                     0x6
#define _UIE_SOFIE_POSITION                                 0x6
#define _UIE_SOFIE_SIZE                                     0x1
#define _UIE_SOFIE_LENGTH                                   0x1
#define _UIE_SOFIE_MASK                                     0x40

// Register: UCFG
#define UCFG UCFG
extern volatile unsigned char           UCFG                __at(0xE11);
#ifndef _LIB_BUILD
asm("UCFG equ 0E11h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PPB0                   :1;
        unsigned PPB1                   :1;
        unsigned FSEN                   :1;
        unsigned UTRDIS                 :1;
        unsigned UPUEN                  :1;
        unsigned                        :1;
        unsigned UOEMON                 :1;
        unsigned UTEYE                  :1;
    };
    struct {
        unsigned UPP0                   :1;
        unsigned UPP1                   :1;
    };
} UCFGbits_t;
extern volatile UCFGbits_t UCFGbits __at(0xE11);
// bitfield macros
#define _UCFG_PPB0_POSN                                     0x0
#define _UCFG_PPB0_POSITION                                 0x0
#define _UCFG_PPB0_SIZE                                     0x1
#define _UCFG_PPB0_LENGTH                                   0x1
#define _UCFG_PPB0_MASK                                     0x1
#define _UCFG_PPB1_POSN                                     0x1
#define _UCFG_PPB1_POSITION                                 0x1
#define _UCFG_PPB1_SIZE                                     0x1
#define _UCFG_PPB1_LENGTH                                   0x1
#define _UCFG_PPB1_MASK                                     0x2
#define _UCFG_FSEN_POSN                                     0x2
#define _UCFG_FSEN_POSITION                                 0x2
#define _UCFG_FSEN_SIZE                                     0x1
#define _UCFG_FSEN_LENGTH                                   0x1
#define _UCFG_FSEN_MASK                                     0x4
#define _UCFG_UTRDIS_POSN                                   0x3
#define _UCFG_UTRDIS_POSITION                               0x3
#define _UCFG_UTRDIS_SIZE                                   0x1
#define _UCFG_UTRDIS_LENGTH                                 0x1
#define _UCFG_UTRDIS_MASK                                   0x8
#define _UCFG_UPUEN_POSN                                    0x4
#define _UCFG_UPUEN_POSITION                                0x4
#define _UCFG_UPUEN_SIZE                                    0x1
#define _UCFG_UPUEN_LENGTH                                  0x1
#define _UCFG_UPUEN_MASK                                    0x10
#define _UCFG_UOEMON_POSN                                   0x6
#define _UCFG_UOEMON_POSITION                               0x6
#define _UCFG_UOEMON_SIZE                                   0x1
#define _UCFG_UOEMON_LENGTH                                 0x1
#define _UCFG_UOEMON_MASK                                   0x40
#define _UCFG_UTEYE_POSN                                    0x7
#define _UCFG_UTEYE_POSITION                                0x7
#define _UCFG_UTEYE_SIZE                                    0x1
#define _UCFG_UTEYE_LENGTH                                  0x1
#define _UCFG_UTEYE_MASK                                    0x80
#define _UCFG_UPP0_POSN                                     0x0
#define _UCFG_UPP0_POSITION                                 0x0
#define _UCFG_UPP0_SIZE                                     0x1
#define _UCFG_UPP0_LENGTH                                   0x1
#define _UCFG_UPP0_MASK                                     0x1
#define _UCFG_UPP1_POSN                                     0x1
#define _UCFG_UPP1_POSITION                                 0x1
#define _UCFG_UPP1_SIZE                                     0x1
#define _UCFG_UPP1_LENGTH                                   0x1
#define _UCFG_UPP1_MASK                                     0x2

// Register: RPOR0_1
#define RPOR0_1 RPOR0_1
extern volatile unsigned char           RPOR0_1             __at(0xE12);
#ifndef _LIB_BUILD
asm("RPOR0_1 equ 0E12h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RPO0R                  :4;
        unsigned RPO1R                  :4;
    };
    struct {
        unsigned RPO0R0                 :1;
        unsigned RPO0R1                 :1;
        unsigned RPO0R2                 :1;
        unsigned RPO0R3                 :1;
        unsigned RPO1R0                 :1;
        unsigned RPO1R1                 :1;
        unsigned RPO1R2                 :1;
        unsigned RPO1R3                 :1;
    };
} RPOR0_1bits_t;
extern volatile RPOR0_1bits_t RPOR0_1bits __at(0xE12);
// bitfield macros
#define _RPOR0_1_RPO0R_POSN                                 0x0
#define _RPOR0_1_RPO0R_POSITION                             0x0
#define _RPOR0_1_RPO0R_SIZE                                 0x4
#define _RPOR0_1_RPO0R_LENGTH                               0x4
#define _RPOR0_1_RPO0R_MASK                                 0xF
#define _RPOR0_1_RPO1R_POSN                                 0x4
#define _RPOR0_1_RPO1R_POSITION                             0x4
#define _RPOR0_1_RPO1R_SIZE                                 0x4
#define _RPOR0_1_RPO1R_LENGTH                               0x4
#define _RPOR0_1_RPO1R_MASK                                 0xF0
#define _RPOR0_1_RPO0R0_POSN                                0x0
#define _RPOR0_1_RPO0R0_POSITION                            0x0
#define _RPOR0_1_RPO0R0_SIZE                                0x1
#define _RPOR0_1_RPO0R0_LENGTH                              0x1
#define _RPOR0_1_RPO0R0_MASK                                0x1
#define _RPOR0_1_RPO0R1_POSN                                0x1
#define _RPOR0_1_RPO0R1_POSITION                            0x1
#define _RPOR0_1_RPO0R1_SIZE                                0x1
#define _RPOR0_1_RPO0R1_LENGTH                              0x1
#define _RPOR0_1_RPO0R1_MASK                                0x2
#define _RPOR0_1_RPO0R2_POSN                                0x2
#define _RPOR0_1_RPO0R2_POSITION                            0x2
#define _RPOR0_1_RPO0R2_SIZE                                0x1
#define _RPOR0_1_RPO0R2_LENGTH                              0x1
#define _RPOR0_1_RPO0R2_MASK                                0x4
#define _RPOR0_1_RPO0R3_POSN                                0x3
#define _RPOR0_1_RPO0R3_POSITION                            0x3
#define _RPOR0_1_RPO0R3_SIZE                                0x1
#define _RPOR0_1_RPO0R3_LENGTH                              0x1
#define _RPOR0_1_RPO0R3_MASK                                0x8
#define _RPOR0_1_RPO1R0_POSN                                0x4
#define _RPOR0_1_RPO1R0_POSITION                            0x4
#define _RPOR0_1_RPO1R0_SIZE                                0x1
#define _RPOR0_1_RPO1R0_LENGTH                              0x1
#define _RPOR0_1_RPO1R0_MASK                                0x10
#define _RPOR0_1_RPO1R1_POSN                                0x5
#define _RPOR0_1_RPO1R1_POSITION                            0x5
#define _RPOR0_1_RPO1R1_SIZE                                0x1
#define _RPOR0_1_RPO1R1_LENGTH                              0x1
#define _RPOR0_1_RPO1R1_MASK                                0x20
#define _RPOR0_1_RPO1R2_POSN                                0x6
#define _RPOR0_1_RPO1R2_POSITION                            0x6
#define _RPOR0_1_RPO1R2_SIZE                                0x1
#define _RPOR0_1_RPO1R2_LENGTH                              0x1
#define _RPOR0_1_RPO1R2_MASK                                0x40
#define _RPOR0_1_RPO1R3_POSN                                0x7
#define _RPOR0_1_RPO1R3_POSITION                            0x7
#define _RPOR0_1_RPO1R3_SIZE                                0x1
#define _RPOR0_1_RPO1R3_LENGTH                              0x1
#define _RPOR0_1_RPO1R3_MASK                                0x80

// Register: RPOR2_3
#define RPOR2_3 RPOR2_3
extern volatile unsigned char           RPOR2_3             __at(0xE13);
#ifndef _LIB_BUILD
asm("RPOR2_3 equ 0E13h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RPO2R                  :4;
        unsigned RPO3R                  :4;
    };
    struct {
        unsigned RPO2R0                 :1;
        unsigned RPO2R1                 :1;
        unsigned RPO2R2                 :1;
        unsigned RPO2R3                 :1;
        unsigned RPO3R0                 :1;
        unsigned RPO3R1                 :1;
        unsigned RPO3R2                 :1;
        unsigned RPO3R3                 :1;
    };
} RPOR2_3bits_t;
extern volatile RPOR2_3bits_t RPOR2_3bits __at(0xE13);
// bitfield macros
#define _RPOR2_3_RPO2R_POSN                                 0x0
#define _RPOR2_3_RPO2R_POSITION                             0x0
#define _RPOR2_3_RPO2R_SIZE                                 0x4
#define _RPOR2_3_RPO2R_LENGTH                               0x4
#define _RPOR2_3_RPO2R_MASK                                 0xF
#define _RPOR2_3_RPO3R_POSN                                 0x4
#define _RPOR2_3_RPO3R_POSITION                             0x4
#define _RPOR2_3_RPO3R_SIZE                                 0x4
#define _RPOR2_3_RPO3R_LENGTH                               0x4
#define _RPOR2_3_RPO3R_MASK                                 0xF0
#define _RPOR2_3_RPO2R0_POSN                                0x0
#define _RPOR2_3_RPO2R0_POSITION                            0x0
#define _RPOR2_3_RPO2R0_SIZE                                0x1
#define _RPOR2_3_RPO2R0_LENGTH                              0x1
#define _RPOR2_3_RPO2R0_MASK                                0x1
#define _RPOR2_3_RPO2R1_POSN                                0x1
#define _RPOR2_3_RPO2R1_POSITION                            0x1
#define _RPOR2_3_RPO2R1_SIZE                                0x1
#define _RPOR2_3_RPO2R1_LENGTH                              0x1
#define _RPOR2_3_RPO2R1_MASK                                0x2
#define _RPOR2_3_RPO2R2_POSN                                0x2
#define _RPOR2_3_RPO2R2_POSITION                            0x2
#define _RPOR2_3_RPO2R2_SIZE                                0x1
#define _RPOR2_3_RPO2R2_LENGTH                              0x1
#define _RPOR2_3_RPO2R2_MASK                                0x4
#define _RPOR2_3_RPO2R3_POSN                                0x3
#define _RPOR2_3_RPO2R3_POSITION                            0x3
#define _RPOR2_3_RPO2R3_SIZE                                0x1
#define _RPOR2_3_RPO2R3_LENGTH                              0x1
#define _RPOR2_3_RPO2R3_MASK                                0x8
#define _RPOR2_3_RPO3R0_POSN                                0x4
#define _RPOR2_3_RPO3R0_POSITION                            0x4
#define _RPOR2_3_RPO3R0_SIZE                                0x1
#define _RPOR2_3_RPO3R0_LENGTH                              0x1
#define _RPOR2_3_RPO3R0_MASK                                0x10
#define _RPOR2_3_RPO3R1_POSN                                0x5
#define _RPOR2_3_RPO3R1_POSITION                            0x5
#define _RPOR2_3_RPO3R1_SIZE                                0x1
#define _RPOR2_3_RPO3R1_LENGTH                              0x1
#define _RPOR2_3_RPO3R1_MASK                                0x20
#define _RPOR2_3_RPO3R2_POSN                                0x6
#define _RPOR2_3_RPO3R2_POSITION                            0x6
#define _RPOR2_3_RPO3R2_SIZE                                0x1
#define _RPOR2_3_RPO3R2_LENGTH                              0x1
#define _RPOR2_3_RPO3R2_MASK                                0x40
#define _RPOR2_3_RPO3R3_POSN                                0x7
#define _RPOR2_3_RPO3R3_POSITION                            0x7
#define _RPOR2_3_RPO3R3_SIZE                                0x1
#define _RPOR2_3_RPO3R3_LENGTH                              0x1
#define _RPOR2_3_RPO3R3_MASK                                0x80

// Register: RPOR4_5
#define RPOR4_5 RPOR4_5
extern volatile unsigned char           RPOR4_5             __at(0xE14);
#ifndef _LIB_BUILD
asm("RPOR4_5 equ 0E14h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RPO4R                  :4;
        unsigned RPO5R                  :4;
    };
    struct {
        unsigned RPO4R0                 :1;
        unsigned RPO4R1                 :1;
        unsigned RPO4R2                 :1;
        unsigned RPO4R3                 :1;
        unsigned RPO5R0                 :1;
        unsigned RPO5R1                 :1;
        unsigned RPO5R2                 :1;
        unsigned RPO5R3                 :1;
    };
} RPOR4_5bits_t;
extern volatile RPOR4_5bits_t RPOR4_5bits __at(0xE14);
// bitfield macros
#define _RPOR4_5_RPO4R_POSN                                 0x0
#define _RPOR4_5_RPO4R_POSITION                             0x0
#define _RPOR4_5_RPO4R_SIZE                                 0x4
#define _RPOR4_5_RPO4R_LENGTH                               0x4
#define _RPOR4_5_RPO4R_MASK                                 0xF
#define _RPOR4_5_RPO5R_POSN                                 0x4
#define _RPOR4_5_RPO5R_POSITION                             0x4
#define _RPOR4_5_RPO5R_SIZE                                 0x4
#define _RPOR4_5_RPO5R_LENGTH                               0x4
#define _RPOR4_5_RPO5R_MASK                                 0xF0
#define _RPOR4_5_RPO4R0_POSN                                0x0
#define _RPOR4_5_RPO4R0_POSITION                            0x0
#define _RPOR4_5_RPO4R0_SIZE                                0x1
#define _RPOR4_5_RPO4R0_LENGTH                              0x1
#define _RPOR4_5_RPO4R0_MASK                                0x1
#define _RPOR4_5_RPO4R1_POSN                                0x1
#define _RPOR4_5_RPO4R1_POSITION                            0x1
#define _RPOR4_5_RPO4R1_SIZE                                0x1
#define _RPOR4_5_RPO4R1_LENGTH                              0x1
#define _RPOR4_5_RPO4R1_MASK                                0x2
#define _RPOR4_5_RPO4R2_POSN                                0x2
#define _RPOR4_5_RPO4R2_POSITION                            0x2
#define _RPOR4_5_RPO4R2_SIZE                                0x1
#define _RPOR4_5_RPO4R2_LENGTH                              0x1
#define _RPOR4_5_RPO4R2_MASK                                0x4
#define _RPOR4_5_RPO4R3_POSN                                0x3
#define _RPOR4_5_RPO4R3_POSITION                            0x3
#define _RPOR4_5_RPO4R3_SIZE                                0x1
#define _RPOR4_5_RPO4R3_LENGTH                              0x1
#define _RPOR4_5_RPO4R3_MASK                                0x8
#define _RPOR4_5_RPO5R0_POSN                                0x4
#define _RPOR4_5_RPO5R0_POSITION                            0x4
#define _RPOR4_5_RPO5R0_SIZE                                0x1
#define _RPOR4_5_RPO5R0_LENGTH                              0x1
#define _RPOR4_5_RPO5R0_MASK                                0x10
#define _RPOR4_5_RPO5R1_POSN                                0x5
#define _RPOR4_5_RPO5R1_POSITION                            0x5
#define _RPOR4_5_RPO5R1_SIZE                                0x1
#define _RPOR4_5_RPO5R1_LENGTH                              0x1
#define _RPOR4_5_RPO5R1_MASK                                0x20
#define _RPOR4_5_RPO5R2_POSN                                0x6
#define _RPOR4_5_RPO5R2_POSITION                            0x6
#define _RPOR4_5_RPO5R2_SIZE                                0x1
#define _RPOR4_5_RPO5R2_LENGTH                              0x1
#define _RPOR4_5_RPO5R2_MASK                                0x40
#define _RPOR4_5_RPO5R3_POSN                                0x7
#define _RPOR4_5_RPO5R3_POSITION                            0x7
#define _RPOR4_5_RPO5R3_SIZE                                0x1
#define _RPOR4_5_RPO5R3_LENGTH                              0x1
#define _RPOR4_5_RPO5R3_MASK                                0x80

