MikroElektronika/core_packages/PIC/XC8/def/PIC18F66J99/mcu.h
// Register: RPOR12_13
#define RPOR12_13 RPOR12_13
extern volatile unsigned char           RPOR12_13           __at(0xE18);
#ifndef _LIB_BUILD
asm("RPOR12_13 equ 0E18h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RPO12R                 :4;
        unsigned RPO13R                 :4;
    };
    struct {
        unsigned RPO12R0                :1;
        unsigned RPO12R1                :1;
        unsigned RPO12R2                :1;
        unsigned RPO12R3                :1;
        unsigned RPO13R0                :1;
        unsigned RPO13R1                :1;
        unsigned RPO13R2                :1;
        unsigned RPO13R3                :1;
    };
} RPOR12_13bits_t;
extern volatile RPOR12_13bits_t RPOR12_13bits __at(0xE18);
// bitfield macros
#define _RPOR12_13_RPO12R_POSN                              0x0
#define _RPOR12_13_RPO12R_POSITION                          0x0
#define _RPOR12_13_RPO12R_SIZE                              0x4
#define _RPOR12_13_RPO12R_LENGTH                            0x4
#define _RPOR12_13_RPO12R_MASK                              0xF
#define _RPOR12_13_RPO13R_POSN                              0x4
#define _RPOR12_13_RPO13R_POSITION                          0x4
#define _RPOR12_13_RPO13R_SIZE                              0x4
#define _RPOR12_13_RPO13R_LENGTH                            0x4
#define _RPOR12_13_RPO13R_MASK                              0xF0
#define _RPOR12_13_RPO12R0_POSN                             0x0
#define _RPOR12_13_RPO12R0_POSITION                         0x0
#define _RPOR12_13_RPO12R0_SIZE                             0x1
#define _RPOR12_13_RPO12R0_LENGTH                           0x1
#define _RPOR12_13_RPO12R0_MASK                             0x1
#define _RPOR12_13_RPO12R1_POSN                             0x1
#define _RPOR12_13_RPO12R1_POSITION                         0x1
#define _RPOR12_13_RPO12R1_SIZE                             0x1
#define _RPOR12_13_RPO12R1_LENGTH                           0x1
#define _RPOR12_13_RPO12R1_MASK                             0x2
#define _RPOR12_13_RPO12R2_POSN                             0x2
#define _RPOR12_13_RPO12R2_POSITION                         0x2
#define _RPOR12_13_RPO12R2_SIZE                             0x1
#define _RPOR12_13_RPO12R2_LENGTH                           0x1
#define _RPOR12_13_RPO12R2_MASK                             0x4
#define _RPOR12_13_RPO12R3_POSN                             0x3
#define _RPOR12_13_RPO12R3_POSITION                         0x3
#define _RPOR12_13_RPO12R3_SIZE                             0x1
#define _RPOR12_13_RPO12R3_LENGTH                           0x1
#define _RPOR12_13_RPO12R3_MASK                             0x8
#define _RPOR12_13_RPO13R0_POSN                             0x4
#define _RPOR12_13_RPO13R0_POSITION                         0x4
#define _RPOR12_13_RPO13R0_SIZE                             0x1
#define _RPOR12_13_RPO13R0_LENGTH                           0x1
#define _RPOR12_13_RPO13R0_MASK                             0x10
#define _RPOR12_13_RPO13R1_POSN                             0x5
#define _RPOR12_13_RPO13R1_POSITION                         0x5
#define _RPOR12_13_RPO13R1_SIZE                             0x1
#define _RPOR12_13_RPO13R1_LENGTH                           0x1
#define _RPOR12_13_RPO13R1_MASK                             0x20
#define _RPOR12_13_RPO13R2_POSN                             0x6
#define _RPOR12_13_RPO13R2_POSITION                         0x6
#define _RPOR12_13_RPO13R2_SIZE                             0x1
#define _RPOR12_13_RPO13R2_LENGTH                           0x1
#define _RPOR12_13_RPO13R2_MASK                             0x40
#define _RPOR12_13_RPO13R3_POSN                             0x7
#define _RPOR12_13_RPO13R3_POSITION                         0x7
#define _RPOR12_13_RPO13R3_SIZE                             0x1
#define _RPOR12_13_RPO13R3_LENGTH                           0x1
#define _RPOR12_13_RPO13R3_MASK                             0x80

// Register: RPOR14_15
#define RPOR14_15 RPOR14_15
extern volatile unsigned char           RPOR14_15           __at(0xE19);
#ifndef _LIB_BUILD
asm("RPOR14_15 equ 0E19h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RPO14R                 :4;
        unsigned RPO15R                 :4;
    };
    struct {
        unsigned RPO14R0                :1;
        unsigned RPO14R1                :1;
        unsigned RPO14R2                :1;
        unsigned RPO14R3                :1;
        unsigned RPO15R0                :1;
        unsigned RPO15R1                :1;
        unsigned RPO15R2                :1;
        unsigned RPO15R3                :1;
    };
} RPOR14_15bits_t;
extern volatile RPOR14_15bits_t RPOR14_15bits __at(0xE19);
// bitfield macros
#define _RPOR14_15_RPO14R_POSN                              0x0
#define _RPOR14_15_RPO14R_POSITION                          0x0
#define _RPOR14_15_RPO14R_SIZE                              0x4
#define _RPOR14_15_RPO14R_LENGTH                            0x4
#define _RPOR14_15_RPO14R_MASK                              0xF
#define _RPOR14_15_RPO15R_POSN                              0x4
#define _RPOR14_15_RPO15R_POSITION                          0x4
#define _RPOR14_15_RPO15R_SIZE                              0x4
#define _RPOR14_15_RPO15R_LENGTH                            0x4
#define _RPOR14_15_RPO15R_MASK                              0xF0
#define _RPOR14_15_RPO14R0_POSN                             0x0
#define _RPOR14_15_RPO14R0_POSITION                         0x0
#define _RPOR14_15_RPO14R0_SIZE                             0x1
#define _RPOR14_15_RPO14R0_LENGTH                           0x1
#define _RPOR14_15_RPO14R0_MASK                             0x1
#define _RPOR14_15_RPO14R1_POSN                             0x1
#define _RPOR14_15_RPO14R1_POSITION                         0x1
#define _RPOR14_15_RPO14R1_SIZE                             0x1
#define _RPOR14_15_RPO14R1_LENGTH                           0x1
#define _RPOR14_15_RPO14R1_MASK                             0x2
#define _RPOR14_15_RPO14R2_POSN                             0x2
#define _RPOR14_15_RPO14R2_POSITION                         0x2
#define _RPOR14_15_RPO14R2_SIZE                             0x1
#define _RPOR14_15_RPO14R2_LENGTH                           0x1
#define _RPOR14_15_RPO14R2_MASK                             0x4
#define _RPOR14_15_RPO14R3_POSN                             0x3
#define _RPOR14_15_RPO14R3_POSITION                         0x3
#define _RPOR14_15_RPO14R3_SIZE                             0x1
#define _RPOR14_15_RPO14R3_LENGTH                           0x1
#define _RPOR14_15_RPO14R3_MASK                             0x8
#define _RPOR14_15_RPO15R0_POSN                             0x4
#define _RPOR14_15_RPO15R0_POSITION                         0x4
#define _RPOR14_15_RPO15R0_SIZE                             0x1
#define _RPOR14_15_RPO15R0_LENGTH                           0x1
#define _RPOR14_15_RPO15R0_MASK                             0x10
#define _RPOR14_15_RPO15R1_POSN                             0x5
#define _RPOR14_15_RPO15R1_POSITION                         0x5
#define _RPOR14_15_RPO15R1_SIZE                             0x1
#define _RPOR14_15_RPO15R1_LENGTH                           0x1
#define _RPOR14_15_RPO15R1_MASK                             0x20
#define _RPOR14_15_RPO15R2_POSN                             0x6
#define _RPOR14_15_RPO15R2_POSITION                         0x6
#define _RPOR14_15_RPO15R2_SIZE                             0x1
#define _RPOR14_15_RPO15R2_LENGTH                           0x1
#define _RPOR14_15_RPO15R2_MASK                             0x40
#define _RPOR14_15_RPO15R3_POSN                             0x7
#define _RPOR14_15_RPO15R3_POSITION                         0x7
#define _RPOR14_15_RPO15R3_SIZE                             0x1
#define _RPOR14_15_RPO15R3_LENGTH                           0x1
#define _RPOR14_15_RPO15R3_MASK                             0x80

// Register: RPOR16_17
#define RPOR16_17 RPOR16_17
extern volatile unsigned char           RPOR16_17           __at(0xE1A);
#ifndef _LIB_BUILD
asm("RPOR16_17 equ 0E1Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RPO16R                 :4;
        unsigned RPO17R                 :4;
    };
    struct {
        unsigned RPO16R0                :1;
        unsigned RPO16R1                :1;
        unsigned RPO16R2                :1;
        unsigned RPO16R3                :1;
        unsigned RPO17R0                :1;
        unsigned RPO17R1                :1;
        unsigned RPO17R2                :1;
        unsigned RPO17R3                :1;
    };
} RPOR16_17bits_t;
extern volatile RPOR16_17bits_t RPOR16_17bits __at(0xE1A);
// bitfield macros
#define _RPOR16_17_RPO16R_POSN                              0x0
#define _RPOR16_17_RPO16R_POSITION                          0x0
#define _RPOR16_17_RPO16R_SIZE                              0x4
#define _RPOR16_17_RPO16R_LENGTH                            0x4
#define _RPOR16_17_RPO16R_MASK                              0xF
#define _RPOR16_17_RPO17R_POSN                              0x4
#define _RPOR16_17_RPO17R_POSITION                          0x4
#define _RPOR16_17_RPO17R_SIZE                              0x4
#define _RPOR16_17_RPO17R_LENGTH                            0x4
#define _RPOR16_17_RPO17R_MASK                              0xF0
#define _RPOR16_17_RPO16R0_POSN                             0x0
#define _RPOR16_17_RPO16R0_POSITION                         0x0
#define _RPOR16_17_RPO16R0_SIZE                             0x1
#define _RPOR16_17_RPO16R0_LENGTH                           0x1
#define _RPOR16_17_RPO16R0_MASK                             0x1
#define _RPOR16_17_RPO16R1_POSN                             0x1
#define _RPOR16_17_RPO16R1_POSITION                         0x1
#define _RPOR16_17_RPO16R1_SIZE                             0x1
#define _RPOR16_17_RPO16R1_LENGTH                           0x1
#define _RPOR16_17_RPO16R1_MASK                             0x2
#define _RPOR16_17_RPO16R2_POSN                             0x2
#define _RPOR16_17_RPO16R2_POSITION                         0x2
#define _RPOR16_17_RPO16R2_SIZE                             0x1
#define _RPOR16_17_RPO16R2_LENGTH                           0x1
#define _RPOR16_17_RPO16R2_MASK                             0x4
#define _RPOR16_17_RPO16R3_POSN                             0x3
#define _RPOR16_17_RPO16R3_POSITION                         0x3
#define _RPOR16_17_RPO16R3_SIZE                             0x1
#define _RPOR16_17_RPO16R3_LENGTH                           0x1
#define _RPOR16_17_RPO16R3_MASK                             0x8
#define _RPOR16_17_RPO17R0_POSN                             0x4
#define _RPOR16_17_RPO17R0_POSITION                         0x4
#define _RPOR16_17_RPO17R0_SIZE                             0x1
#define _RPOR16_17_RPO17R0_LENGTH                           0x1
#define _RPOR16_17_RPO17R0_MASK                             0x10
#define _RPOR16_17_RPO17R1_POSN                             0x5
#define _RPOR16_17_RPO17R1_POSITION                         0x5
#define _RPOR16_17_RPO17R1_SIZE                             0x1
#define _RPOR16_17_RPO17R1_LENGTH                           0x1
#define _RPOR16_17_RPO17R1_MASK                             0x20
#define _RPOR16_17_RPO17R2_POSN                             0x6
#define _RPOR16_17_RPO17R2_POSITION                         0x6
#define _RPOR16_17_RPO17R2_SIZE                             0x1
#define _RPOR16_17_RPO17R2_LENGTH                           0x1
#define _RPOR16_17_RPO17R2_MASK                             0x40
#define _RPOR16_17_RPO17R3_POSN                             0x7
#define _RPOR16_17_RPO17R3_POSITION                         0x7
#define _RPOR16_17_RPO17R3_SIZE                             0x1
#define _RPOR16_17_RPO17R3_LENGTH                           0x1
#define _RPOR16_17_RPO17R3_MASK                             0x80

// Register: RPOR18_19
#define RPOR18_19 RPOR18_19
extern volatile unsigned char           RPOR18_19           __at(0xE1B);
#ifndef _LIB_BUILD
asm("RPOR18_19 equ 0E1Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RPO18R                 :4;
        unsigned RPO19R                 :4;
    };
    struct {
        unsigned RPO18R0                :1;
        unsigned RPO18R1                :1;
        unsigned RPO18R2                :1;
        unsigned RPO18R3                :1;
        unsigned RPO19R0                :1;
        unsigned RPO19R1                :1;
        unsigned RPO19R2                :1;
        unsigned RPO19R3                :1;
    };
} RPOR18_19bits_t;
extern volatile RPOR18_19bits_t RPOR18_19bits __at(0xE1B);
// bitfield macros
#define _RPOR18_19_RPO18R_POSN                              0x0
#define _RPOR18_19_RPO18R_POSITION                          0x0
#define _RPOR18_19_RPO18R_SIZE                              0x4
#define _RPOR18_19_RPO18R_LENGTH                            0x4
#define _RPOR18_19_RPO18R_MASK                              0xF
#define _RPOR18_19_RPO19R_POSN                              0x4
#define _RPOR18_19_RPO19R_POSITION                          0x4
#define _RPOR18_19_RPO19R_SIZE                              0x4
#define _RPOR18_19_RPO19R_LENGTH                            0x4
#define _RPOR18_19_RPO19R_MASK                              0xF0
#define _RPOR18_19_RPO18R0_POSN                             0x0
#define _RPOR18_19_RPO18R0_POSITION                         0x0
#define _RPOR18_19_RPO18R0_SIZE                             0x1
#define _RPOR18_19_RPO18R0_LENGTH                           0x1
#define _RPOR18_19_RPO18R0_MASK                             0x1
#define _RPOR18_19_RPO18R1_POSN                             0x1
#define _RPOR18_19_RPO18R1_POSITION                         0x1
#define _RPOR18_19_RPO18R1_SIZE                             0x1
#define _RPOR18_19_RPO18R1_LENGTH                           0x1
#define _RPOR18_19_RPO18R1_MASK                             0x2
#define _RPOR18_19_RPO18R2_POSN                             0x2
#define _RPOR18_19_RPO18R2_POSITION                         0x2
#define _RPOR18_19_RPO18R2_SIZE                             0x1
#define _RPOR18_19_RPO18R2_LENGTH                           0x1
#define _RPOR18_19_RPO18R2_MASK                             0x4
#define _RPOR18_19_RPO18R3_POSN                             0x3
#define _RPOR18_19_RPO18R3_POSITION                         0x3
#define _RPOR18_19_RPO18R3_SIZE                             0x1
#define _RPOR18_19_RPO18R3_LENGTH                           0x1
#define _RPOR18_19_RPO18R3_MASK                             0x8
#define _RPOR18_19_RPO19R0_POSN                             0x4
#define _RPOR18_19_RPO19R0_POSITION                         0x4
#define _RPOR18_19_RPO19R0_SIZE                             0x1
#define _RPOR18_19_RPO19R0_LENGTH                           0x1
#define _RPOR18_19_RPO19R0_MASK                             0x10
#define _RPOR18_19_RPO19R1_POSN                             0x5
#define _RPOR18_19_RPO19R1_POSITION                         0x5
#define _RPOR18_19_RPO19R1_SIZE                             0x1
#define _RPOR18_19_RPO19R1_LENGTH                           0x1
#define _RPOR18_19_RPO19R1_MASK                             0x20
#define _RPOR18_19_RPO19R2_POSN                             0x6
#define _RPOR18_19_RPO19R2_POSITION                         0x6
#define _RPOR18_19_RPO19R2_SIZE                             0x1
#define _RPOR18_19_RPO19R2_LENGTH                           0x1
#define _RPOR18_19_RPO19R2_MASK                             0x40
#define _RPOR18_19_RPO19R3_POSN                             0x7
#define _RPOR18_19_RPO19R3_POSITION                         0x7
#define _RPOR18_19_RPO19R3_SIZE                             0x1
#define _RPOR18_19_RPO19R3_LENGTH                           0x1
#define _RPOR18_19_RPO19R3_MASK                             0x80

