MikroElektronika/core_packages/PIC/XC8/def/PIC18F66J99/mcu.h
extern volatile RPOR24_25bits_t RPOR24_25bits __at(0xE1E);
// bitfield macros
#define _RPOR24_25_RPO24R_POSN                              0x0
#define _RPOR24_25_RPO24R_POSITION                          0x0
#define _RPOR24_25_RPO24R_SIZE                              0x4
#define _RPOR24_25_RPO24R_LENGTH                            0x4
#define _RPOR24_25_RPO24R_MASK                              0xF
#define _RPOR24_25_RPO25R_POSN                              0x4
#define _RPOR24_25_RPO25R_POSITION                          0x4
#define _RPOR24_25_RPO25R_SIZE                              0x4
#define _RPOR24_25_RPO25R_LENGTH                            0x4
#define _RPOR24_25_RPO25R_MASK                              0xF0
#define _RPOR24_25_RPO24R0_POSN                             0x0
#define _RPOR24_25_RPO24R0_POSITION                         0x0
#define _RPOR24_25_RPO24R0_SIZE                             0x1
#define _RPOR24_25_RPO24R0_LENGTH                           0x1
#define _RPOR24_25_RPO24R0_MASK                             0x1
#define _RPOR24_25_RPO24R1_POSN                             0x1
#define _RPOR24_25_RPO24R1_POSITION                         0x1
#define _RPOR24_25_RPO24R1_SIZE                             0x1
#define _RPOR24_25_RPO24R1_LENGTH                           0x1
#define _RPOR24_25_RPO24R1_MASK                             0x2
#define _RPOR24_25_RPO24R2_POSN                             0x2
#define _RPOR24_25_RPO24R2_POSITION                         0x2
#define _RPOR24_25_RPO24R2_SIZE                             0x1
#define _RPOR24_25_RPO24R2_LENGTH                           0x1
#define _RPOR24_25_RPO24R2_MASK                             0x4
#define _RPOR24_25_RPO24R3_POSN                             0x3
#define _RPOR24_25_RPO24R3_POSITION                         0x3
#define _RPOR24_25_RPO24R3_SIZE                             0x1
#define _RPOR24_25_RPO24R3_LENGTH                           0x1
#define _RPOR24_25_RPO24R3_MASK                             0x8
#define _RPOR24_25_RPO25R0_POSN                             0x4
#define _RPOR24_25_RPO25R0_POSITION                         0x4
#define _RPOR24_25_RPO25R0_SIZE                             0x1
#define _RPOR24_25_RPO25R0_LENGTH                           0x1
#define _RPOR24_25_RPO25R0_MASK                             0x10
#define _RPOR24_25_RPO25R1_POSN                             0x5
#define _RPOR24_25_RPO25R1_POSITION                         0x5
#define _RPOR24_25_RPO25R1_SIZE                             0x1
#define _RPOR24_25_RPO25R1_LENGTH                           0x1
#define _RPOR24_25_RPO25R1_MASK                             0x20
#define _RPOR24_25_RPO25R2_POSN                             0x6
#define _RPOR24_25_RPO25R2_POSITION                         0x6
#define _RPOR24_25_RPO25R2_SIZE                             0x1
#define _RPOR24_25_RPO25R2_LENGTH                           0x1
#define _RPOR24_25_RPO25R2_MASK                             0x40
#define _RPOR24_25_RPO25R3_POSN                             0x7
#define _RPOR24_25_RPO25R3_POSITION                         0x7
#define _RPOR24_25_RPO25R3_SIZE                             0x1
#define _RPOR24_25_RPO25R3_LENGTH                           0x1
#define _RPOR24_25_RPO25R3_MASK                             0x80

// Register: RPOR26_27
#define RPOR26_27 RPOR26_27
extern volatile unsigned char           RPOR26_27           __at(0xE1F);
#ifndef _LIB_BUILD
asm("RPOR26_27 equ 0E1Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RPO26R                 :4;
        unsigned RPO27R                 :4;
    };
    struct {
        unsigned RPO26R0                :1;
        unsigned RPO26R1                :1;
        unsigned RPO26R2                :1;
        unsigned RPO26R3                :1;
        unsigned RPO27R0                :1;
        unsigned RPO27R1                :1;
        unsigned RPO27R2                :1;
        unsigned RPO27R3                :1;
    };
} RPOR26_27bits_t;
extern volatile RPOR26_27bits_t RPOR26_27bits __at(0xE1F);
// bitfield macros
#define _RPOR26_27_RPO26R_POSN                              0x0
#define _RPOR26_27_RPO26R_POSITION                          0x0
#define _RPOR26_27_RPO26R_SIZE                              0x4
#define _RPOR26_27_RPO26R_LENGTH                            0x4
#define _RPOR26_27_RPO26R_MASK                              0xF
#define _RPOR26_27_RPO27R_POSN                              0x4
#define _RPOR26_27_RPO27R_POSITION                          0x4
#define _RPOR26_27_RPO27R_SIZE                              0x4
#define _RPOR26_27_RPO27R_LENGTH                            0x4
#define _RPOR26_27_RPO27R_MASK                              0xF0
#define _RPOR26_27_RPO26R0_POSN                             0x0
#define _RPOR26_27_RPO26R0_POSITION                         0x0
#define _RPOR26_27_RPO26R0_SIZE                             0x1
#define _RPOR26_27_RPO26R0_LENGTH                           0x1
#define _RPOR26_27_RPO26R0_MASK                             0x1
#define _RPOR26_27_RPO26R1_POSN                             0x1
#define _RPOR26_27_RPO26R1_POSITION                         0x1
#define _RPOR26_27_RPO26R1_SIZE                             0x1
#define _RPOR26_27_RPO26R1_LENGTH                           0x1
#define _RPOR26_27_RPO26R1_MASK                             0x2
#define _RPOR26_27_RPO26R2_POSN                             0x2
#define _RPOR26_27_RPO26R2_POSITION                         0x2
#define _RPOR26_27_RPO26R2_SIZE                             0x1
#define _RPOR26_27_RPO26R2_LENGTH                           0x1
#define _RPOR26_27_RPO26R2_MASK                             0x4
#define _RPOR26_27_RPO26R3_POSN                             0x3
#define _RPOR26_27_RPO26R3_POSITION                         0x3
#define _RPOR26_27_RPO26R3_SIZE                             0x1
#define _RPOR26_27_RPO26R3_LENGTH                           0x1
#define _RPOR26_27_RPO26R3_MASK                             0x8
#define _RPOR26_27_RPO27R0_POSN                             0x4
#define _RPOR26_27_RPO27R0_POSITION                         0x4
#define _RPOR26_27_RPO27R0_SIZE                             0x1
#define _RPOR26_27_RPO27R0_LENGTH                           0x1
#define _RPOR26_27_RPO27R0_MASK                             0x10
#define _RPOR26_27_RPO27R1_POSN                             0x5
#define _RPOR26_27_RPO27R1_POSITION                         0x5
#define _RPOR26_27_RPO27R1_SIZE                             0x1
#define _RPOR26_27_RPO27R1_LENGTH                           0x1
#define _RPOR26_27_RPO27R1_MASK                             0x20
#define _RPOR26_27_RPO27R2_POSN                             0x6
#define _RPOR26_27_RPO27R2_POSITION                         0x6
#define _RPOR26_27_RPO27R2_SIZE                             0x1
#define _RPOR26_27_RPO27R2_LENGTH                           0x1
#define _RPOR26_27_RPO27R2_MASK                             0x40
#define _RPOR26_27_RPO27R3_POSN                             0x7
#define _RPOR26_27_RPO27R3_POSITION                         0x7
#define _RPOR26_27_RPO27R3_SIZE                             0x1
#define _RPOR26_27_RPO27R3_LENGTH                           0x1
#define _RPOR26_27_RPO27R3_MASK                             0x80

// Register: RPOR28_29
#define RPOR28_29 RPOR28_29
extern volatile unsigned char           RPOR28_29           __at(0xE20);
#ifndef _LIB_BUILD
asm("RPOR28_29 equ 0E20h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RPO28R                 :4;
        unsigned RPO29R                 :4;
    };
    struct {
        unsigned RPO28R0                :1;
        unsigned RPO28R1                :1;
        unsigned RPO28R2                :1;
        unsigned RPO28R3                :1;
        unsigned RPO29R0                :1;
        unsigned RPO29R1                :1;
        unsigned RPO29R2                :1;
        unsigned RPO29R3                :1;
    };
} RPOR28_29bits_t;
extern volatile RPOR28_29bits_t RPOR28_29bits __at(0xE20);
// bitfield macros
#define _RPOR28_29_RPO28R_POSN                              0x0
#define _RPOR28_29_RPO28R_POSITION                          0x0
#define _RPOR28_29_RPO28R_SIZE                              0x4
#define _RPOR28_29_RPO28R_LENGTH                            0x4
#define _RPOR28_29_RPO28R_MASK                              0xF
#define _RPOR28_29_RPO29R_POSN                              0x4
#define _RPOR28_29_RPO29R_POSITION                          0x4
#define _RPOR28_29_RPO29R_SIZE                              0x4
#define _RPOR28_29_RPO29R_LENGTH                            0x4
#define _RPOR28_29_RPO29R_MASK                              0xF0
#define _RPOR28_29_RPO28R0_POSN                             0x0
#define _RPOR28_29_RPO28R0_POSITION                         0x0
#define _RPOR28_29_RPO28R0_SIZE                             0x1
#define _RPOR28_29_RPO28R0_LENGTH                           0x1
#define _RPOR28_29_RPO28R0_MASK                             0x1
#define _RPOR28_29_RPO28R1_POSN                             0x1
#define _RPOR28_29_RPO28R1_POSITION                         0x1
#define _RPOR28_29_RPO28R1_SIZE                             0x1
#define _RPOR28_29_RPO28R1_LENGTH                           0x1
#define _RPOR28_29_RPO28R1_MASK                             0x2
#define _RPOR28_29_RPO28R2_POSN                             0x2
#define _RPOR28_29_RPO28R2_POSITION                         0x2
#define _RPOR28_29_RPO28R2_SIZE                             0x1
#define _RPOR28_29_RPO28R2_LENGTH                           0x1
#define _RPOR28_29_RPO28R2_MASK                             0x4
#define _RPOR28_29_RPO28R3_POSN                             0x3
#define _RPOR28_29_RPO28R3_POSITION                         0x3
#define _RPOR28_29_RPO28R3_SIZE                             0x1
#define _RPOR28_29_RPO28R3_LENGTH                           0x1
#define _RPOR28_29_RPO28R3_MASK                             0x8
#define _RPOR28_29_RPO29R0_POSN                             0x4
#define _RPOR28_29_RPO29R0_POSITION                         0x4
#define _RPOR28_29_RPO29R0_SIZE                             0x1
#define _RPOR28_29_RPO29R0_LENGTH                           0x1
#define _RPOR28_29_RPO29R0_MASK                             0x10
#define _RPOR28_29_RPO29R1_POSN                             0x5
#define _RPOR28_29_RPO29R1_POSITION                         0x5
#define _RPOR28_29_RPO29R1_SIZE                             0x1
#define _RPOR28_29_RPO29R1_LENGTH                           0x1
#define _RPOR28_29_RPO29R1_MASK                             0x20
#define _RPOR28_29_RPO29R2_POSN                             0x6
#define _RPOR28_29_RPO29R2_POSITION                         0x6
#define _RPOR28_29_RPO29R2_SIZE                             0x1
#define _RPOR28_29_RPO29R2_LENGTH                           0x1
#define _RPOR28_29_RPO29R2_MASK                             0x40
#define _RPOR28_29_RPO29R3_POSN                             0x7
#define _RPOR28_29_RPO29R3_POSITION                         0x7
#define _RPOR28_29_RPO29R3_SIZE                             0x1
#define _RPOR28_29_RPO29R3_LENGTH                           0x1
#define _RPOR28_29_RPO29R3_MASK                             0x80

// Register: RPOR30_31
#define RPOR30_31 RPOR30_31
extern volatile unsigned char           RPOR30_31           __at(0xE21);
#ifndef _LIB_BUILD
asm("RPOR30_31 equ 0E21h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RPO30R                 :4;
        unsigned RPO31R                 :4;
    };
    struct {
        unsigned RPO30R0                :1;
        unsigned RPO30R1                :1;
        unsigned RPO30R2                :1;
        unsigned RPO30R3                :1;
        unsigned RPO31R0                :1;
        unsigned RPO31R1                :1;
        unsigned RPO31R2                :1;
        unsigned RPO31R3                :1;
    };
} RPOR30_31bits_t;
extern volatile RPOR30_31bits_t RPOR30_31bits __at(0xE21);
// bitfield macros
#define _RPOR30_31_RPO30R_POSN                              0x0
#define _RPOR30_31_RPO30R_POSITION                          0x0
#define _RPOR30_31_RPO30R_SIZE                              0x4
#define _RPOR30_31_RPO30R_LENGTH                            0x4
#define _RPOR30_31_RPO30R_MASK                              0xF
#define _RPOR30_31_RPO31R_POSN                              0x4
#define _RPOR30_31_RPO31R_POSITION                          0x4
#define _RPOR30_31_RPO31R_SIZE                              0x4
#define _RPOR30_31_RPO31R_LENGTH                            0x4
#define _RPOR30_31_RPO31R_MASK                              0xF0
#define _RPOR30_31_RPO30R0_POSN                             0x0
#define _RPOR30_31_RPO30R0_POSITION                         0x0
#define _RPOR30_31_RPO30R0_SIZE                             0x1
#define _RPOR30_31_RPO30R0_LENGTH                           0x1
#define _RPOR30_31_RPO30R0_MASK                             0x1
#define _RPOR30_31_RPO30R1_POSN                             0x1
#define _RPOR30_31_RPO30R1_POSITION                         0x1
#define _RPOR30_31_RPO30R1_SIZE                             0x1
#define _RPOR30_31_RPO30R1_LENGTH                           0x1
#define _RPOR30_31_RPO30R1_MASK                             0x2
#define _RPOR30_31_RPO30R2_POSN                             0x2
#define _RPOR30_31_RPO30R2_POSITION                         0x2
#define _RPOR30_31_RPO30R2_SIZE                             0x1
#define _RPOR30_31_RPO30R2_LENGTH                           0x1
#define _RPOR30_31_RPO30R2_MASK                             0x4
#define _RPOR30_31_RPO30R3_POSN                             0x3
#define _RPOR30_31_RPO30R3_POSITION                         0x3
#define _RPOR30_31_RPO30R3_SIZE                             0x1
#define _RPOR30_31_RPO30R3_LENGTH                           0x1
#define _RPOR30_31_RPO30R3_MASK                             0x8
#define _RPOR30_31_RPO31R0_POSN                             0x4
#define _RPOR30_31_RPO31R0_POSITION                         0x4
#define _RPOR30_31_RPO31R0_SIZE                             0x1
#define _RPOR30_31_RPO31R0_LENGTH                           0x1
#define _RPOR30_31_RPO31R0_MASK                             0x10
#define _RPOR30_31_RPO31R1_POSN                             0x5
#define _RPOR30_31_RPO31R1_POSITION                         0x5
#define _RPOR30_31_RPO31R1_SIZE                             0x1
#define _RPOR30_31_RPO31R1_LENGTH                           0x1
#define _RPOR30_31_RPO31R1_MASK                             0x20
#define _RPOR30_31_RPO31R2_POSN                             0x6
#define _RPOR30_31_RPO31R2_POSITION                         0x6
#define _RPOR30_31_RPO31R2_SIZE                             0x1
#define _RPOR30_31_RPO31R2_LENGTH                           0x1
#define _RPOR30_31_RPO31R2_MASK                             0x40
#define _RPOR30_31_RPO31R3_POSN                             0x7
#define _RPOR30_31_RPO31R3_POSITION                         0x7
#define _RPOR30_31_RPO31R3_SIZE                             0x1
#define _RPOR30_31_RPO31R3_LENGTH                           0x1
#define _RPOR30_31_RPO31R3_MASK                             0x80

// Register: RPOR32_33
#define RPOR32_33 RPOR32_33
extern volatile unsigned char           RPOR32_33           __at(0xE22);
#ifndef _LIB_BUILD
asm("RPOR32_33 equ 0E22h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RPO32R                 :4;
        unsigned RPO33R                 :4;
    };
    struct {
        unsigned RPO32R0                :1;
        unsigned RPO32R1                :1;
        unsigned RPO32R2                :1;
        unsigned RPO32R3                :1;
        unsigned RPO33R0                :1;
        unsigned RPO33R1                :1;
        unsigned RPO33R2                :1;
        unsigned RPO33R3                :1;
    };
} RPOR32_33bits_t;
extern volatile RPOR32_33bits_t RPOR32_33bits __at(0xE22);
// bitfield macros
#define _RPOR32_33_RPO32R_POSN                              0x0
#define _RPOR32_33_RPO32R_POSITION                          0x0
#define _RPOR32_33_RPO32R_SIZE                              0x4
#define _RPOR32_33_RPO32R_LENGTH                            0x4
#define _RPOR32_33_RPO32R_MASK                              0xF
#define _RPOR32_33_RPO33R_POSN                              0x4
#define _RPOR32_33_RPO33R_POSITION                          0x4
#define _RPOR32_33_RPO33R_SIZE                              0x4
#define _RPOR32_33_RPO33R_LENGTH                            0x4
#define _RPOR32_33_RPO33R_MASK                              0xF0
#define _RPOR32_33_RPO32R0_POSN                             0x0
#define _RPOR32_33_RPO32R0_POSITION                         0x0
#define _RPOR32_33_RPO32R0_SIZE                             0x1
#define _RPOR32_33_RPO32R0_LENGTH                           0x1
#define _RPOR32_33_RPO32R0_MASK                             0x1
#define _RPOR32_33_RPO32R1_POSN                             0x1
#define _RPOR32_33_RPO32R1_POSITION                         0x1
#define _RPOR32_33_RPO32R1_SIZE                             0x1
#define _RPOR32_33_RPO32R1_LENGTH                           0x1
#define _RPOR32_33_RPO32R1_MASK                             0x2
#define _RPOR32_33_RPO32R2_POSN                             0x2
#define _RPOR32_33_RPO32R2_POSITION                         0x2
#define _RPOR32_33_RPO32R2_SIZE                             0x1
#define _RPOR32_33_RPO32R2_LENGTH                           0x1
#define _RPOR32_33_RPO32R2_MASK                             0x4
#define _RPOR32_33_RPO32R3_POSN                             0x3
#define _RPOR32_33_RPO32R3_POSITION                         0x3
#define _RPOR32_33_RPO32R3_SIZE                             0x1
#define _RPOR32_33_RPO32R3_LENGTH                           0x1
#define _RPOR32_33_RPO32R3_MASK                             0x8
#define _RPOR32_33_RPO33R0_POSN                             0x4
#define _RPOR32_33_RPO33R0_POSITION                         0x4
#define _RPOR32_33_RPO33R0_SIZE                             0x1
#define _RPOR32_33_RPO33R0_LENGTH                           0x1
#define _RPOR32_33_RPO33R0_MASK                             0x10
#define _RPOR32_33_RPO33R1_POSN                             0x5
#define _RPOR32_33_RPO33R1_POSITION                         0x5
#define _RPOR32_33_RPO33R1_SIZE                             0x1
#define _RPOR32_33_RPO33R1_LENGTH                           0x1
#define _RPOR32_33_RPO33R1_MASK                             0x20
#define _RPOR32_33_RPO33R2_POSN                             0x6
#define _RPOR32_33_RPO33R2_POSITION                         0x6
#define _RPOR32_33_RPO33R2_SIZE                             0x1
#define _RPOR32_33_RPO33R2_LENGTH                           0x1
#define _RPOR32_33_RPO33R2_MASK                             0x40
#define _RPOR32_33_RPO33R3_POSN                             0x7
#define _RPOR32_33_RPO33R3_POSITION                         0x7
#define _RPOR32_33_RPO33R3_SIZE                             0x1
#define _RPOR32_33_RPO33R3_LENGTH                           0x1
#define _RPOR32_33_RPO33R3_MASK                             0x80

// Register: RPOR34_35
#define RPOR34_35 RPOR34_35
extern volatile unsigned char           RPOR34_35           __at(0xE23);
#ifndef _LIB_BUILD
asm("RPOR34_35 equ 0E23h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RPO34R                 :4;
        unsigned RPO35R                 :4;
    };
    struct {
        unsigned RPO34R0                :1;
        unsigned RPO34R1                :1;
        unsigned RPO34R2                :1;
        unsigned RPO34R3                :1;
        unsigned RPO35R0                :1;
        unsigned RPO35R1                :1;
        unsigned RPO35R2                :1;
        unsigned RPO35R3                :1;
    };
} RPOR34_35bits_t;
extern volatile RPOR34_35bits_t RPOR34_35bits __at(0xE23);
// bitfield macros
#define _RPOR34_35_RPO34R_POSN                              0x0
#define _RPOR34_35_RPO34R_POSITION                          0x0
#define _RPOR34_35_RPO34R_SIZE                              0x4
#define _RPOR34_35_RPO34R_LENGTH                            0x4
#define _RPOR34_35_RPO34R_MASK                              0xF
#define _RPOR34_35_RPO35R_POSN                              0x4
#define _RPOR34_35_RPO35R_POSITION                          0x4
#define _RPOR34_35_RPO35R_SIZE                              0x4
#define _RPOR34_35_RPO35R_LENGTH                            0x4
#define _RPOR34_35_RPO35R_MASK                              0xF0
#define _RPOR34_35_RPO34R0_POSN                             0x0
#define _RPOR34_35_RPO34R0_POSITION                         0x0
#define _RPOR34_35_RPO34R0_SIZE                             0x1
#define _RPOR34_35_RPO34R0_LENGTH                           0x1
#define _RPOR34_35_RPO34R0_MASK                             0x1
#define _RPOR34_35_RPO34R1_POSN                             0x1
#define _RPOR34_35_RPO34R1_POSITION                         0x1
#define _RPOR34_35_RPO34R1_SIZE                             0x1
#define _RPOR34_35_RPO34R1_LENGTH                           0x1
#define _RPOR34_35_RPO34R1_MASK                             0x2
#define _RPOR34_35_RPO34R2_POSN                             0x2
#define _RPOR34_35_RPO34R2_POSITION                         0x2
#define _RPOR34_35_RPO34R2_SIZE                             0x1
#define _RPOR34_35_RPO34R2_LENGTH                           0x1
#define _RPOR34_35_RPO34R2_MASK                             0x4
#define _RPOR34_35_RPO34R3_POSN                             0x3
#define _RPOR34_35_RPO34R3_POSITION                         0x3
#define _RPOR34_35_RPO34R3_SIZE                             0x1
#define _RPOR34_35_RPO34R3_LENGTH                           0x1
#define _RPOR34_35_RPO34R3_MASK                             0x8
#define _RPOR34_35_RPO35R0_POSN                             0x4
#define _RPOR34_35_RPO35R0_POSITION                         0x4
#define _RPOR34_35_RPO35R0_SIZE                             0x1
#define _RPOR34_35_RPO35R0_LENGTH                           0x1
#define _RPOR34_35_RPO35R0_MASK                             0x10
#define _RPOR34_35_RPO35R1_POSN                             0x5
#define _RPOR34_35_RPO35R1_POSITION                         0x5
#define _RPOR34_35_RPO35R1_SIZE                             0x1
#define _RPOR34_35_RPO35R1_LENGTH                           0x1
#define _RPOR34_35_RPO35R1_MASK                             0x20
#define _RPOR34_35_RPO35R2_POSN                             0x6
#define _RPOR34_35_RPO35R2_POSITION                         0x6
#define _RPOR34_35_RPO35R2_SIZE                             0x1
#define _RPOR34_35_RPO35R2_LENGTH                           0x1
#define _RPOR34_35_RPO35R2_MASK                             0x40
#define _RPOR34_35_RPO35R3_POSN                             0x7
#define _RPOR34_35_RPO35R3_POSITION                         0x7
#define _RPOR34_35_RPO35R3_SIZE                             0x1
#define _RPOR34_35_RPO35R3_LENGTH                           0x1
#define _RPOR34_35_RPO35R3_MASK                             0x80

