MikroElektronika/core_packages/PIC/XC8/def/PIC18F66J99/mcu.h
// Register: RPOR44_45
#define RPOR44_45 RPOR44_45
extern volatile unsigned char           RPOR44_45           __at(0xE28);
#ifndef _LIB_BUILD
asm("RPOR44_45 equ 0E28h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RPO44R                 :4;
        unsigned RPO45R                 :4;
    };
    struct {
        unsigned RPO44R0                :1;
        unsigned RPO44R1                :1;
        unsigned RPO44R2                :1;
        unsigned RPO44R3                :1;
        unsigned RPO45R0                :1;
        unsigned RPO45R1                :1;
        unsigned RPO45R2                :1;
        unsigned RPO45R3                :1;
    };
} RPOR44_45bits_t;
extern volatile RPOR44_45bits_t RPOR44_45bits __at(0xE28);
// bitfield macros
#define _RPOR44_45_RPO44R_POSN                              0x0
#define _RPOR44_45_RPO44R_POSITION                          0x0
#define _RPOR44_45_RPO44R_SIZE                              0x4
#define _RPOR44_45_RPO44R_LENGTH                            0x4
#define _RPOR44_45_RPO44R_MASK                              0xF
#define _RPOR44_45_RPO45R_POSN                              0x4
#define _RPOR44_45_RPO45R_POSITION                          0x4
#define _RPOR44_45_RPO45R_SIZE                              0x4
#define _RPOR44_45_RPO45R_LENGTH                            0x4
#define _RPOR44_45_RPO45R_MASK                              0xF0
#define _RPOR44_45_RPO44R0_POSN                             0x0
#define _RPOR44_45_RPO44R0_POSITION                         0x0
#define _RPOR44_45_RPO44R0_SIZE                             0x1
#define _RPOR44_45_RPO44R0_LENGTH                           0x1
#define _RPOR44_45_RPO44R0_MASK                             0x1
#define _RPOR44_45_RPO44R1_POSN                             0x1
#define _RPOR44_45_RPO44R1_POSITION                         0x1
#define _RPOR44_45_RPO44R1_SIZE                             0x1
#define _RPOR44_45_RPO44R1_LENGTH                           0x1
#define _RPOR44_45_RPO44R1_MASK                             0x2
#define _RPOR44_45_RPO44R2_POSN                             0x2
#define _RPOR44_45_RPO44R2_POSITION                         0x2
#define _RPOR44_45_RPO44R2_SIZE                             0x1
#define _RPOR44_45_RPO44R2_LENGTH                           0x1
#define _RPOR44_45_RPO44R2_MASK                             0x4
#define _RPOR44_45_RPO44R3_POSN                             0x3
#define _RPOR44_45_RPO44R3_POSITION                         0x3
#define _RPOR44_45_RPO44R3_SIZE                             0x1
#define _RPOR44_45_RPO44R3_LENGTH                           0x1
#define _RPOR44_45_RPO44R3_MASK                             0x8
#define _RPOR44_45_RPO45R0_POSN                             0x4
#define _RPOR44_45_RPO45R0_POSITION                         0x4
#define _RPOR44_45_RPO45R0_SIZE                             0x1
#define _RPOR44_45_RPO45R0_LENGTH                           0x1
#define _RPOR44_45_RPO45R0_MASK                             0x10
#define _RPOR44_45_RPO45R1_POSN                             0x5
#define _RPOR44_45_RPO45R1_POSITION                         0x5
#define _RPOR44_45_RPO45R1_SIZE                             0x1
#define _RPOR44_45_RPO45R1_LENGTH                           0x1
#define _RPOR44_45_RPO45R1_MASK                             0x20
#define _RPOR44_45_RPO45R2_POSN                             0x6
#define _RPOR44_45_RPO45R2_POSITION                         0x6
#define _RPOR44_45_RPO45R2_SIZE                             0x1
#define _RPOR44_45_RPO45R2_LENGTH                           0x1
#define _RPOR44_45_RPO45R2_MASK                             0x40
#define _RPOR44_45_RPO45R3_POSN                             0x7
#define _RPOR44_45_RPO45R3_POSITION                         0x7
#define _RPOR44_45_RPO45R3_SIZE                             0x1
#define _RPOR44_45_RPO45R3_LENGTH                           0x1
#define _RPOR44_45_RPO45R3_MASK                             0x80

// Register: RPOR46
#define RPOR46 RPOR46
extern volatile unsigned char           RPOR46              __at(0xE29);
#ifndef _LIB_BUILD
asm("RPOR46 equ 0E29h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RPO46R                 :4;
    };
    struct {
        unsigned RPO46R0                :1;
        unsigned RPO46R1                :1;
        unsigned RPO46R2                :1;
        unsigned RPO46R3                :1;
    };
} RPOR46bits_t;
extern volatile RPOR46bits_t RPOR46bits __at(0xE29);
// bitfield macros
#define _RPOR46_RPO46R_POSN                                 0x0
#define _RPOR46_RPO46R_POSITION                             0x0
#define _RPOR46_RPO46R_SIZE                                 0x4
#define _RPOR46_RPO46R_LENGTH                               0x4
#define _RPOR46_RPO46R_MASK                                 0xF
#define _RPOR46_RPO46R0_POSN                                0x0
#define _RPOR46_RPO46R0_POSITION                            0x0
#define _RPOR46_RPO46R0_SIZE                                0x1
#define _RPOR46_RPO46R0_LENGTH                              0x1
#define _RPOR46_RPO46R0_MASK                                0x1
#define _RPOR46_RPO46R1_POSN                                0x1
#define _RPOR46_RPO46R1_POSITION                            0x1
#define _RPOR46_RPO46R1_SIZE                                0x1
#define _RPOR46_RPO46R1_LENGTH                              0x1
#define _RPOR46_RPO46R1_MASK                                0x2
#define _RPOR46_RPO46R2_POSN                                0x2
#define _RPOR46_RPO46R2_POSITION                            0x2
#define _RPOR46_RPO46R2_SIZE                                0x1
#define _RPOR46_RPO46R2_LENGTH                              0x1
#define _RPOR46_RPO46R2_MASK                                0x4
#define _RPOR46_RPO46R3_POSN                                0x3
#define _RPOR46_RPO46R3_POSITION                            0x3
#define _RPOR46_RPO46R3_SIZE                                0x1
#define _RPOR46_RPO46R3_LENGTH                              0x1
#define _RPOR46_RPO46R3_MASK                                0x8

