MikroElektronika/core_packages/PIC/XC8/def/PIC18F66J99/mcu.h
// Register: RPINR36_37
#define RPINR36_37 RPINR36_37
extern volatile unsigned char           RPINR36_37          __at(0xE3C);
#ifndef _LIB_BUILD
asm("RPINR36_37 equ 0E3Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP8R                  :4;
        unsigned CCP9R                  :4;
    };
    struct {
        unsigned CCP8R0                 :1;
        unsigned CCP8R1                 :1;
        unsigned CCP8R2                 :1;
        unsigned CCP8R3                 :1;
        unsigned CCP9R0                 :1;
        unsigned CCP9R1                 :1;
        unsigned CCP9R2                 :1;
        unsigned CCP9R3                 :1;
    };
} RPINR36_37bits_t;
extern volatile RPINR36_37bits_t RPINR36_37bits __at(0xE3C);
// bitfield macros
#define _RPINR36_37_CCP8R_POSN                              0x0
#define _RPINR36_37_CCP8R_POSITION                          0x0
#define _RPINR36_37_CCP8R_SIZE                              0x4
#define _RPINR36_37_CCP8R_LENGTH                            0x4
#define _RPINR36_37_CCP8R_MASK                              0xF
#define _RPINR36_37_CCP9R_POSN                              0x4
#define _RPINR36_37_CCP9R_POSITION                          0x4
#define _RPINR36_37_CCP9R_SIZE                              0x4
#define _RPINR36_37_CCP9R_LENGTH                            0x4
#define _RPINR36_37_CCP9R_MASK                              0xF0
#define _RPINR36_37_CCP8R0_POSN                             0x0
#define _RPINR36_37_CCP8R0_POSITION                         0x0
#define _RPINR36_37_CCP8R0_SIZE                             0x1
#define _RPINR36_37_CCP8R0_LENGTH                           0x1
#define _RPINR36_37_CCP8R0_MASK                             0x1
#define _RPINR36_37_CCP8R1_POSN                             0x1
#define _RPINR36_37_CCP8R1_POSITION                         0x1
#define _RPINR36_37_CCP8R1_SIZE                             0x1
#define _RPINR36_37_CCP8R1_LENGTH                           0x1
#define _RPINR36_37_CCP8R1_MASK                             0x2
#define _RPINR36_37_CCP8R2_POSN                             0x2
#define _RPINR36_37_CCP8R2_POSITION                         0x2
#define _RPINR36_37_CCP8R2_SIZE                             0x1
#define _RPINR36_37_CCP8R2_LENGTH                           0x1
#define _RPINR36_37_CCP8R2_MASK                             0x4
#define _RPINR36_37_CCP8R3_POSN                             0x3
#define _RPINR36_37_CCP8R3_POSITION                         0x3
#define _RPINR36_37_CCP8R3_SIZE                             0x1
#define _RPINR36_37_CCP8R3_LENGTH                           0x1
#define _RPINR36_37_CCP8R3_MASK                             0x8
#define _RPINR36_37_CCP9R0_POSN                             0x4
#define _RPINR36_37_CCP9R0_POSITION                         0x4
#define _RPINR36_37_CCP9R0_SIZE                             0x1
#define _RPINR36_37_CCP9R0_LENGTH                           0x1
#define _RPINR36_37_CCP9R0_MASK                             0x10
#define _RPINR36_37_CCP9R1_POSN                             0x5
#define _RPINR36_37_CCP9R1_POSITION                         0x5
#define _RPINR36_37_CCP9R1_SIZE                             0x1
#define _RPINR36_37_CCP9R1_LENGTH                           0x1
#define _RPINR36_37_CCP9R1_MASK                             0x20
#define _RPINR36_37_CCP9R2_POSN                             0x6
#define _RPINR36_37_CCP9R2_POSITION                         0x6
#define _RPINR36_37_CCP9R2_SIZE                             0x1
#define _RPINR36_37_CCP9R2_LENGTH                           0x1
#define _RPINR36_37_CCP9R2_MASK                             0x40
#define _RPINR36_37_CCP9R3_POSN                             0x7
#define _RPINR36_37_CCP9R3_POSITION                         0x7
#define _RPINR36_37_CCP9R3_SIZE                             0x1
#define _RPINR36_37_CCP9R3_LENGTH                           0x1
#define _RPINR36_37_CCP9R3_MASK                             0x80

// Register: RPINR38_39
#define RPINR38_39 RPINR38_39
extern volatile unsigned char           RPINR38_39          __at(0xE3D);
#ifndef _LIB_BUILD
asm("RPINR38_39 equ 0E3Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP10R                 :4;
        unsigned T0CKIR                 :4;
    };
    struct {
        unsigned CCP10R0                :1;
        unsigned CCP10R1                :1;
        unsigned CCP10R2                :1;
        unsigned CCP10R3                :1;
        unsigned T0CKIR0                :1;
        unsigned T0CKIR1                :1;
        unsigned T0CKIR2                :1;
        unsigned T0CKIR3                :1;
    };
} RPINR38_39bits_t;
extern volatile RPINR38_39bits_t RPINR38_39bits __at(0xE3D);
// bitfield macros
#define _RPINR38_39_CCP10R_POSN                             0x0
#define _RPINR38_39_CCP10R_POSITION                         0x0
#define _RPINR38_39_CCP10R_SIZE                             0x4
#define _RPINR38_39_CCP10R_LENGTH                           0x4
#define _RPINR38_39_CCP10R_MASK                             0xF
#define _RPINR38_39_T0CKIR_POSN                             0x4
#define _RPINR38_39_T0CKIR_POSITION                         0x4
#define _RPINR38_39_T0CKIR_SIZE                             0x4
#define _RPINR38_39_T0CKIR_LENGTH                           0x4
#define _RPINR38_39_T0CKIR_MASK                             0xF0
#define _RPINR38_39_CCP10R0_POSN                            0x0
#define _RPINR38_39_CCP10R0_POSITION                        0x0
#define _RPINR38_39_CCP10R0_SIZE                            0x1
#define _RPINR38_39_CCP10R0_LENGTH                          0x1
#define _RPINR38_39_CCP10R0_MASK                            0x1
#define _RPINR38_39_CCP10R1_POSN                            0x1
#define _RPINR38_39_CCP10R1_POSITION                        0x1
#define _RPINR38_39_CCP10R1_SIZE                            0x1
#define _RPINR38_39_CCP10R1_LENGTH                          0x1
#define _RPINR38_39_CCP10R1_MASK                            0x2
#define _RPINR38_39_CCP10R2_POSN                            0x2
#define _RPINR38_39_CCP10R2_POSITION                        0x2
#define _RPINR38_39_CCP10R2_SIZE                            0x1
#define _RPINR38_39_CCP10R2_LENGTH                          0x1
#define _RPINR38_39_CCP10R2_MASK                            0x4
#define _RPINR38_39_CCP10R3_POSN                            0x3
#define _RPINR38_39_CCP10R3_POSITION                        0x3
#define _RPINR38_39_CCP10R3_SIZE                            0x1
#define _RPINR38_39_CCP10R3_LENGTH                          0x1
#define _RPINR38_39_CCP10R3_MASK                            0x8
#define _RPINR38_39_T0CKIR0_POSN                            0x4
#define _RPINR38_39_T0CKIR0_POSITION                        0x4
#define _RPINR38_39_T0CKIR0_SIZE                            0x1
#define _RPINR38_39_T0CKIR0_LENGTH                          0x1
#define _RPINR38_39_T0CKIR0_MASK                            0x10
#define _RPINR38_39_T0CKIR1_POSN                            0x5
#define _RPINR38_39_T0CKIR1_POSITION                        0x5
#define _RPINR38_39_T0CKIR1_SIZE                            0x1
#define _RPINR38_39_T0CKIR1_LENGTH                          0x1
#define _RPINR38_39_T0CKIR1_MASK                            0x20
#define _RPINR38_39_T0CKIR2_POSN                            0x6
#define _RPINR38_39_T0CKIR2_POSITION                        0x6
#define _RPINR38_39_T0CKIR2_SIZE                            0x1
#define _RPINR38_39_T0CKIR2_LENGTH                          0x1
#define _RPINR38_39_T0CKIR2_MASK                            0x40
#define _RPINR38_39_T0CKIR3_POSN                            0x7
#define _RPINR38_39_T0CKIR3_POSITION                        0x7
#define _RPINR38_39_T0CKIR3_SIZE                            0x1
#define _RPINR38_39_T0CKIR3_LENGTH                          0x1
#define _RPINR38_39_T0CKIR3_MASK                            0x80

// Register: RPINR40_41
#define RPINR40_41 RPINR40_41
extern volatile unsigned char           RPINR40_41          __at(0xE3E);
#ifndef _LIB_BUILD
asm("RPINR40_41 equ 0E3Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T1GR                   :4;
        unsigned T1CKIR                 :4;
    };
    struct {
        unsigned T1GR0                  :1;
        unsigned T1GR1                  :1;
        unsigned T1GR2                  :1;
        unsigned T1GR3                  :1;
        unsigned T1CKIR0                :1;
        unsigned T1CKIR1                :1;
        unsigned T1CKIR2                :1;
        unsigned T1CKIR3                :1;
    };
} RPINR40_41bits_t;
extern volatile RPINR40_41bits_t RPINR40_41bits __at(0xE3E);
// bitfield macros
#define _RPINR40_41_T1GR_POSN                               0x0
#define _RPINR40_41_T1GR_POSITION                           0x0
#define _RPINR40_41_T1GR_SIZE                               0x4
#define _RPINR40_41_T1GR_LENGTH                             0x4
#define _RPINR40_41_T1GR_MASK                               0xF
#define _RPINR40_41_T1CKIR_POSN                             0x4
#define _RPINR40_41_T1CKIR_POSITION                         0x4
#define _RPINR40_41_T1CKIR_SIZE                             0x4
#define _RPINR40_41_T1CKIR_LENGTH                           0x4
#define _RPINR40_41_T1CKIR_MASK                             0xF0
#define _RPINR40_41_T1GR0_POSN                              0x0
#define _RPINR40_41_T1GR0_POSITION                          0x0
#define _RPINR40_41_T1GR0_SIZE                              0x1
#define _RPINR40_41_T1GR0_LENGTH                            0x1
#define _RPINR40_41_T1GR0_MASK                              0x1
#define _RPINR40_41_T1GR1_POSN                              0x1
#define _RPINR40_41_T1GR1_POSITION                          0x1
#define _RPINR40_41_T1GR1_SIZE                              0x1
#define _RPINR40_41_T1GR1_LENGTH                            0x1
#define _RPINR40_41_T1GR1_MASK                              0x2
#define _RPINR40_41_T1GR2_POSN                              0x2
#define _RPINR40_41_T1GR2_POSITION                          0x2
#define _RPINR40_41_T1GR2_SIZE                              0x1
#define _RPINR40_41_T1GR2_LENGTH                            0x1
#define _RPINR40_41_T1GR2_MASK                              0x4
#define _RPINR40_41_T1GR3_POSN                              0x3
#define _RPINR40_41_T1GR3_POSITION                          0x3
#define _RPINR40_41_T1GR3_SIZE                              0x1
#define _RPINR40_41_T1GR3_LENGTH                            0x1
#define _RPINR40_41_T1GR3_MASK                              0x8
#define _RPINR40_41_T1CKIR0_POSN                            0x4
#define _RPINR40_41_T1CKIR0_POSITION                        0x4
#define _RPINR40_41_T1CKIR0_SIZE                            0x1
#define _RPINR40_41_T1CKIR0_LENGTH                          0x1
#define _RPINR40_41_T1CKIR0_MASK                            0x10
#define _RPINR40_41_T1CKIR1_POSN                            0x5
#define _RPINR40_41_T1CKIR1_POSITION                        0x5
#define _RPINR40_41_T1CKIR1_SIZE                            0x1
#define _RPINR40_41_T1CKIR1_LENGTH                          0x1
#define _RPINR40_41_T1CKIR1_MASK                            0x20
#define _RPINR40_41_T1CKIR2_POSN                            0x6
#define _RPINR40_41_T1CKIR2_POSITION                        0x6
#define _RPINR40_41_T1CKIR2_SIZE                            0x1
#define _RPINR40_41_T1CKIR2_LENGTH                          0x1
#define _RPINR40_41_T1CKIR2_MASK                            0x40
#define _RPINR40_41_T1CKIR3_POSN                            0x7
#define _RPINR40_41_T1CKIR3_POSITION                        0x7
#define _RPINR40_41_T1CKIR3_SIZE                            0x1
#define _RPINR40_41_T1CKIR3_LENGTH                          0x1
#define _RPINR40_41_T1CKIR3_MASK                            0x80

// Register: RPINR42_43
#define RPINR42_43 RPINR42_43
extern volatile unsigned char           RPINR42_43          __at(0xE3F);
#ifndef _LIB_BUILD
asm("RPINR42_43 equ 0E3Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T3GR                   :4;
        unsigned T3CKIR                 :4;
    };
    struct {
        unsigned T3GR0                  :1;
        unsigned T3GR1                  :1;
        unsigned T3GR2                  :1;
        unsigned T3GR3                  :1;
        unsigned T3CKIR0                :1;
        unsigned T3CKIR1                :1;
        unsigned T3CKIR2                :1;
        unsigned T3CKIR3                :1;
    };
} RPINR42_43bits_t;
extern volatile RPINR42_43bits_t RPINR42_43bits __at(0xE3F);
// bitfield macros
#define _RPINR42_43_T3GR_POSN                               0x0
#define _RPINR42_43_T3GR_POSITION                           0x0
#define _RPINR42_43_T3GR_SIZE                               0x4
#define _RPINR42_43_T3GR_LENGTH                             0x4
#define _RPINR42_43_T3GR_MASK                               0xF
#define _RPINR42_43_T3CKIR_POSN                             0x4
#define _RPINR42_43_T3CKIR_POSITION                         0x4
#define _RPINR42_43_T3CKIR_SIZE                             0x4
#define _RPINR42_43_T3CKIR_LENGTH                           0x4
#define _RPINR42_43_T3CKIR_MASK                             0xF0
#define _RPINR42_43_T3GR0_POSN                              0x0
#define _RPINR42_43_T3GR0_POSITION                          0x0
#define _RPINR42_43_T3GR0_SIZE                              0x1
#define _RPINR42_43_T3GR0_LENGTH                            0x1
#define _RPINR42_43_T3GR0_MASK                              0x1
#define _RPINR42_43_T3GR1_POSN                              0x1
#define _RPINR42_43_T3GR1_POSITION                          0x1
#define _RPINR42_43_T3GR1_SIZE                              0x1
#define _RPINR42_43_T3GR1_LENGTH                            0x1
#define _RPINR42_43_T3GR1_MASK                              0x2
#define _RPINR42_43_T3GR2_POSN                              0x2
#define _RPINR42_43_T3GR2_POSITION                          0x2
#define _RPINR42_43_T3GR2_SIZE                              0x1
#define _RPINR42_43_T3GR2_LENGTH                            0x1
#define _RPINR42_43_T3GR2_MASK                              0x4
#define _RPINR42_43_T3GR3_POSN                              0x3
#define _RPINR42_43_T3GR3_POSITION                          0x3
#define _RPINR42_43_T3GR3_SIZE                              0x1
#define _RPINR42_43_T3GR3_LENGTH                            0x1
#define _RPINR42_43_T3GR3_MASK                              0x8
#define _RPINR42_43_T3CKIR0_POSN                            0x4
#define _RPINR42_43_T3CKIR0_POSITION                        0x4
#define _RPINR42_43_T3CKIR0_SIZE                            0x1
#define _RPINR42_43_T3CKIR0_LENGTH                          0x1
#define _RPINR42_43_T3CKIR0_MASK                            0x10
#define _RPINR42_43_T3CKIR1_POSN                            0x5
#define _RPINR42_43_T3CKIR1_POSITION                        0x5
#define _RPINR42_43_T3CKIR1_SIZE                            0x1
#define _RPINR42_43_T3CKIR1_LENGTH                          0x1
#define _RPINR42_43_T3CKIR1_MASK                            0x20
#define _RPINR42_43_T3CKIR2_POSN                            0x6
#define _RPINR42_43_T3CKIR2_POSITION                        0x6
#define _RPINR42_43_T3CKIR2_SIZE                            0x1
#define _RPINR42_43_T3CKIR2_LENGTH                          0x1
#define _RPINR42_43_T3CKIR2_MASK                            0x40
#define _RPINR42_43_T3CKIR3_POSN                            0x7
#define _RPINR42_43_T3CKIR3_POSITION                        0x7
#define _RPINR42_43_T3CKIR3_SIZE                            0x1
#define _RPINR42_43_T3CKIR3_LENGTH                          0x1
#define _RPINR42_43_T3CKIR3_MASK                            0x80

