MikroElektronika/core_packages/PIC/XC8/def/PIC18F66J99/mcu.h
// Register: ADCHIT0L
#define ADCHIT0L ADCHIT0L
extern volatile unsigned char           ADCHIT0L            __at(0xE7E);
#ifndef _LIB_BUILD
asm("ADCHIT0L equ 0E7Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CHH                    :8;
    };
    struct {
        unsigned CHH0                   :1;
        unsigned CHH1                   :1;
        unsigned CHH2                   :1;
        unsigned CHH3                   :1;
        unsigned CHH4                   :1;
        unsigned CHH5                   :1;
        unsigned CHH6                   :1;
        unsigned CHH7                   :1;
    };
} ADCHIT0Lbits_t;
extern volatile ADCHIT0Lbits_t ADCHIT0Lbits __at(0xE7E);
// bitfield macros
#define _ADCHIT0L_CHH_POSN                                  0x0
#define _ADCHIT0L_CHH_POSITION                              0x0
#define _ADCHIT0L_CHH_SIZE                                  0x8
#define _ADCHIT0L_CHH_LENGTH                                0x8
#define _ADCHIT0L_CHH_MASK                                  0xFF
#define _ADCHIT0L_CHH0_POSN                                 0x0
#define _ADCHIT0L_CHH0_POSITION                             0x0
#define _ADCHIT0L_CHH0_SIZE                                 0x1
#define _ADCHIT0L_CHH0_LENGTH                               0x1
#define _ADCHIT0L_CHH0_MASK                                 0x1
#define _ADCHIT0L_CHH1_POSN                                 0x1
#define _ADCHIT0L_CHH1_POSITION                             0x1
#define _ADCHIT0L_CHH1_SIZE                                 0x1
#define _ADCHIT0L_CHH1_LENGTH                               0x1
#define _ADCHIT0L_CHH1_MASK                                 0x2
#define _ADCHIT0L_CHH2_POSN                                 0x2
#define _ADCHIT0L_CHH2_POSITION                             0x2
#define _ADCHIT0L_CHH2_SIZE                                 0x1
#define _ADCHIT0L_CHH2_LENGTH                               0x1
#define _ADCHIT0L_CHH2_MASK                                 0x4
#define _ADCHIT0L_CHH3_POSN                                 0x3
#define _ADCHIT0L_CHH3_POSITION                             0x3
#define _ADCHIT0L_CHH3_SIZE                                 0x1
#define _ADCHIT0L_CHH3_LENGTH                               0x1
#define _ADCHIT0L_CHH3_MASK                                 0x8
#define _ADCHIT0L_CHH4_POSN                                 0x4
#define _ADCHIT0L_CHH4_POSITION                             0x4
#define _ADCHIT0L_CHH4_SIZE                                 0x1
#define _ADCHIT0L_CHH4_LENGTH                               0x1
#define _ADCHIT0L_CHH4_MASK                                 0x10
#define _ADCHIT0L_CHH5_POSN                                 0x5
#define _ADCHIT0L_CHH5_POSITION                             0x5
#define _ADCHIT0L_CHH5_SIZE                                 0x1
#define _ADCHIT0L_CHH5_LENGTH                               0x1
#define _ADCHIT0L_CHH5_MASK                                 0x20
#define _ADCHIT0L_CHH6_POSN                                 0x6
#define _ADCHIT0L_CHH6_POSITION                             0x6
#define _ADCHIT0L_CHH6_SIZE                                 0x1
#define _ADCHIT0L_CHH6_LENGTH                               0x1
#define _ADCHIT0L_CHH6_MASK                                 0x40
#define _ADCHIT0L_CHH7_POSN                                 0x7
#define _ADCHIT0L_CHH7_POSITION                             0x7
#define _ADCHIT0L_CHH7_SIZE                                 0x1
#define _ADCHIT0L_CHH7_LENGTH                               0x1
#define _ADCHIT0L_CHH7_MASK                                 0x80

// Register: ADCHIT0H
#define ADCHIT0H ADCHIT0H
extern volatile unsigned char           ADCHIT0H            __at(0xE7F);
#ifndef _LIB_BUILD
asm("ADCHIT0H equ 0E7Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CHH                    :8;
    };
    struct {
        unsigned CHH8                   :1;
        unsigned CHH9                   :1;
        unsigned CHH10                  :1;
        unsigned CHH11                  :1;
        unsigned CHH12                  :1;
        unsigned CHH13                  :1;
        unsigned CHH14                  :1;
        unsigned CHH15                  :1;
    };
} ADCHIT0Hbits_t;
extern volatile ADCHIT0Hbits_t ADCHIT0Hbits __at(0xE7F);
// bitfield macros
#define _ADCHIT0H_CHH_POSN                                  0x0
#define _ADCHIT0H_CHH_POSITION                              0x0
#define _ADCHIT0H_CHH_SIZE                                  0x8
#define _ADCHIT0H_CHH_LENGTH                                0x8
#define _ADCHIT0H_CHH_MASK                                  0xFF
#define _ADCHIT0H_CHH8_POSN                                 0x0
#define _ADCHIT0H_CHH8_POSITION                             0x0
#define _ADCHIT0H_CHH8_SIZE                                 0x1
#define _ADCHIT0H_CHH8_LENGTH                               0x1
#define _ADCHIT0H_CHH8_MASK                                 0x1
#define _ADCHIT0H_CHH9_POSN                                 0x1
#define _ADCHIT0H_CHH9_POSITION                             0x1
#define _ADCHIT0H_CHH9_SIZE                                 0x1
#define _ADCHIT0H_CHH9_LENGTH                               0x1
#define _ADCHIT0H_CHH9_MASK                                 0x2
#define _ADCHIT0H_CHH10_POSN                                0x2
#define _ADCHIT0H_CHH10_POSITION                            0x2
#define _ADCHIT0H_CHH10_SIZE                                0x1
#define _ADCHIT0H_CHH10_LENGTH                              0x1
#define _ADCHIT0H_CHH10_MASK                                0x4
#define _ADCHIT0H_CHH11_POSN                                0x3
#define _ADCHIT0H_CHH11_POSITION                            0x3
#define _ADCHIT0H_CHH11_SIZE                                0x1
#define _ADCHIT0H_CHH11_LENGTH                              0x1
#define _ADCHIT0H_CHH11_MASK                                0x8
#define _ADCHIT0H_CHH12_POSN                                0x4
#define _ADCHIT0H_CHH12_POSITION                            0x4
#define _ADCHIT0H_CHH12_SIZE                                0x1
#define _ADCHIT0H_CHH12_LENGTH                              0x1
#define _ADCHIT0H_CHH12_MASK                                0x10
#define _ADCHIT0H_CHH13_POSN                                0x5
#define _ADCHIT0H_CHH13_POSITION                            0x5
#define _ADCHIT0H_CHH13_SIZE                                0x1
#define _ADCHIT0H_CHH13_LENGTH                              0x1
#define _ADCHIT0H_CHH13_MASK                                0x20
#define _ADCHIT0H_CHH14_POSN                                0x6
#define _ADCHIT0H_CHH14_POSITION                            0x6
#define _ADCHIT0H_CHH14_SIZE                                0x1
#define _ADCHIT0H_CHH14_LENGTH                              0x1
#define _ADCHIT0H_CHH14_MASK                                0x40
#define _ADCHIT0H_CHH15_POSN                                0x7
#define _ADCHIT0H_CHH15_POSITION                            0x7
#define _ADCHIT0H_CHH15_SIZE                                0x1
#define _ADCHIT0H_CHH15_LENGTH                              0x1
#define _ADCHIT0H_CHH15_MASK                                0x80

// Register: ADCHIT1L
#define ADCHIT1L ADCHIT1L
extern volatile unsigned char           ADCHIT1L            __at(0xE80);
#ifndef _LIB_BUILD
asm("ADCHIT1L equ 0E80h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CHH                    :8;
    };
    struct {
        unsigned CHH16                  :1;
        unsigned CHH17                  :1;
        unsigned CHH18                  :1;
        unsigned CHH19                  :1;
        unsigned CHH20                  :1;
        unsigned CHH21                  :1;
        unsigned CHH22                  :1;
        unsigned CHH23                  :1;
    };
} ADCHIT1Lbits_t;
