MikroElektronika/core_packages/PIC/XC8/def/PIC18F66J99/mcu.h
extern volatile LCDDATA14bits_t LCDDATA14bits __at(0xE9C);
// bitfield macros
#define _LCDDATA14_S48C1_POSN                               0x0
#define _LCDDATA14_S48C1_POSITION                           0x0
#define _LCDDATA14_S48C1_SIZE                               0x1
#define _LCDDATA14_S48C1_LENGTH                             0x1
#define _LCDDATA14_S48C1_MASK                               0x1
#define _LCDDATA14_S49C1_POSN                               0x1
#define _LCDDATA14_S49C1_POSITION                           0x1
#define _LCDDATA14_S49C1_SIZE                               0x1
#define _LCDDATA14_S49C1_LENGTH                             0x1
#define _LCDDATA14_S49C1_MASK                               0x2
#define _LCDDATA14_S50C1_POSN                               0x2
#define _LCDDATA14_S50C1_POSITION                           0x2
#define _LCDDATA14_S50C1_SIZE                               0x1
#define _LCDDATA14_S50C1_LENGTH                             0x1
#define _LCDDATA14_S50C1_MASK                               0x4
#define _LCDDATA14_S51C1_POSN                               0x3
#define _LCDDATA14_S51C1_POSITION                           0x3
#define _LCDDATA14_S51C1_SIZE                               0x1
#define _LCDDATA14_S51C1_LENGTH                             0x1
#define _LCDDATA14_S51C1_MASK                               0x8
#define _LCDDATA14_S52C1_POSN                               0x4
#define _LCDDATA14_S52C1_POSITION                           0x4
#define _LCDDATA14_S52C1_SIZE                               0x1
#define _LCDDATA14_S52C1_LENGTH                             0x1
#define _LCDDATA14_S52C1_MASK                               0x10
#define _LCDDATA14_S53C1_POSN                               0x5
#define _LCDDATA14_S53C1_POSITION                           0x5
#define _LCDDATA14_S53C1_SIZE                               0x1
#define _LCDDATA14_S53C1_LENGTH                             0x1
#define _LCDDATA14_S53C1_MASK                               0x20
#define _LCDDATA14_S54C1_POSN                               0x6
#define _LCDDATA14_S54C1_POSITION                           0x6
#define _LCDDATA14_S54C1_SIZE                               0x1
#define _LCDDATA14_S54C1_LENGTH                             0x1
#define _LCDDATA14_S54C1_MASK                               0x40
#define _LCDDATA14_S55C1_POSN                               0x7
#define _LCDDATA14_S55C1_POSITION                           0x7
#define _LCDDATA14_S55C1_SIZE                               0x1
#define _LCDDATA14_S55C1_LENGTH                             0x1
#define _LCDDATA14_S55C1_MASK                               0x80
#define _LCDDATA14_MSK0_POSN                                0x0
#define _LCDDATA14_MSK0_POSITION                            0x0
#define _LCDDATA14_MSK0_SIZE                                0x1
#define _LCDDATA14_MSK0_LENGTH                              0x1
#define _LCDDATA14_MSK0_MASK                                0x1
#define _LCDDATA14_MSK1_POSN                                0x1
#define _LCDDATA14_MSK1_POSITION                            0x1
#define _LCDDATA14_MSK1_SIZE                                0x1
#define _LCDDATA14_MSK1_LENGTH                              0x1
#define _LCDDATA14_MSK1_MASK                                0x2
#define _LCDDATA14_MSK2_POSN                                0x2
#define _LCDDATA14_MSK2_POSITION                            0x2
#define _LCDDATA14_MSK2_SIZE                                0x1
#define _LCDDATA14_MSK2_LENGTH                              0x1
#define _LCDDATA14_MSK2_MASK                                0x4
#define _LCDDATA14_MSK3_POSN                                0x3
#define _LCDDATA14_MSK3_POSITION                            0x3
#define _LCDDATA14_MSK3_SIZE                                0x1
#define _LCDDATA14_MSK3_LENGTH                              0x1
#define _LCDDATA14_MSK3_MASK                                0x8
#define _LCDDATA14_MSK4_POSN                                0x4
#define _LCDDATA14_MSK4_POSITION                            0x4
#define _LCDDATA14_MSK4_SIZE                                0x1
#define _LCDDATA14_MSK4_LENGTH                              0x1
#define _LCDDATA14_MSK4_MASK                                0x10
#define _LCDDATA14_MSK5_POSN                                0x5
#define _LCDDATA14_MSK5_POSITION                            0x5
#define _LCDDATA14_MSK5_SIZE                                0x1
#define _LCDDATA14_MSK5_LENGTH                              0x1
#define _LCDDATA14_MSK5_MASK                                0x20
#define _LCDDATA14_MSK6_POSN                                0x6
#define _LCDDATA14_MSK6_POSITION                            0x6
#define _LCDDATA14_MSK6_SIZE                                0x1
#define _LCDDATA14_MSK6_LENGTH                              0x1
#define _LCDDATA14_MSK6_MASK                                0x40
#define _LCDDATA14_MSK7_POSN                                0x7
#define _LCDDATA14_MSK7_POSITION                            0x7
#define _LCDDATA14_MSK7_SIZE                                0x1
#define _LCDDATA14_MSK7_LENGTH                              0x1
#define _LCDDATA14_MSK7_MASK                                0x80

// Register: LCDDATA15
#define LCDDATA15 LCDDATA15
extern volatile unsigned char           LCDDATA15           __at(0xE9D);
#ifndef _LIB_BUILD
asm("LCDDATA15 equ 0E9Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S56C1                  :1;
        unsigned S57C1                  :1;
        unsigned S58C1                  :1;
        unsigned S59C1                  :1;
        unsigned S60C1                  :1;
        unsigned S61C1                  :1;
        unsigned S62C1                  :1;
        unsigned S63C1                  :1;
    };
} LCDDATA15bits_t;
extern volatile LCDDATA15bits_t LCDDATA15bits __at(0xE9D);
// bitfield macros
#define _LCDDATA15_S56C1_POSN                               0x0
#define _LCDDATA15_S56C1_POSITION                           0x0
#define _LCDDATA15_S56C1_SIZE                               0x1
#define _LCDDATA15_S56C1_LENGTH                             0x1
#define _LCDDATA15_S56C1_MASK                               0x1
#define _LCDDATA15_S57C1_POSN                               0x1
#define _LCDDATA15_S57C1_POSITION                           0x1
#define _LCDDATA15_S57C1_SIZE                               0x1
#define _LCDDATA15_S57C1_LENGTH                             0x1
#define _LCDDATA15_S57C1_MASK                               0x2
#define _LCDDATA15_S58C1_POSN                               0x2
#define _LCDDATA15_S58C1_POSITION                           0x2
#define _LCDDATA15_S58C1_SIZE                               0x1
#define _LCDDATA15_S58C1_LENGTH                             0x1
#define _LCDDATA15_S58C1_MASK                               0x4
#define _LCDDATA15_S59C1_POSN                               0x3
#define _LCDDATA15_S59C1_POSITION                           0x3
#define _LCDDATA15_S59C1_SIZE                               0x1
#define _LCDDATA15_S59C1_LENGTH                             0x1
#define _LCDDATA15_S59C1_MASK                               0x8
#define _LCDDATA15_S60C1_POSN                               0x4
#define _LCDDATA15_S60C1_POSITION                           0x4
#define _LCDDATA15_S60C1_SIZE                               0x1
#define _LCDDATA15_S60C1_LENGTH                             0x1
#define _LCDDATA15_S60C1_MASK                               0x10
#define _LCDDATA15_S61C1_POSN                               0x5
#define _LCDDATA15_S61C1_POSITION                           0x5
#define _LCDDATA15_S61C1_SIZE                               0x1
#define _LCDDATA15_S61C1_LENGTH                             0x1
#define _LCDDATA15_S61C1_MASK                               0x20
#define _LCDDATA15_S62C1_POSN                               0x6
#define _LCDDATA15_S62C1_POSITION                           0x6
#define _LCDDATA15_S62C1_SIZE                               0x1
#define _LCDDATA15_S62C1_LENGTH                             0x1
#define _LCDDATA15_S62C1_MASK                               0x40
#define _LCDDATA15_S63C1_POSN                               0x7
#define _LCDDATA15_S63C1_POSITION                           0x7
#define _LCDDATA15_S63C1_SIZE                               0x1
#define _LCDDATA15_S63C1_LENGTH                             0x1
#define _LCDDATA15_S63C1_MASK                               0x80

// Register: LCDDATA16
#define LCDDATA16 LCDDATA16
extern volatile unsigned char           LCDDATA16           __at(0xE9E);
#ifndef _LIB_BUILD
asm("LCDDATA16 equ 0E9Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S00C2                  :1;
        unsigned S01C2                  :1;
        unsigned S02C2                  :1;
        unsigned S03C2                  :1;
        unsigned S04C2                  :1;
        unsigned S05C2                  :1;
        unsigned S06C2                  :1;
        unsigned S07C2                  :1;
    };
    struct {
        unsigned T4CKPS016              :1;
        unsigned T4CKPS116              :1;
        unsigned                        :1;
        unsigned T4OUTPS016             :1;
        unsigned T4OUTPS116             :1;
        unsigned T4OUTPS216             :1;
        unsigned T4OUTPS316             :1;
    };
} LCDDATA16bits_t;
extern volatile LCDDATA16bits_t LCDDATA16bits __at(0xE9E);
// bitfield macros
#define _LCDDATA16_S00C2_POSN                               0x0
#define _LCDDATA16_S00C2_POSITION                           0x0
#define _LCDDATA16_S00C2_SIZE                               0x1
#define _LCDDATA16_S00C2_LENGTH                             0x1
#define _LCDDATA16_S00C2_MASK                               0x1
#define _LCDDATA16_S01C2_POSN                               0x1
#define _LCDDATA16_S01C2_POSITION                           0x1
#define _LCDDATA16_S01C2_SIZE                               0x1
#define _LCDDATA16_S01C2_LENGTH                             0x1
#define _LCDDATA16_S01C2_MASK                               0x2
#define _LCDDATA16_S02C2_POSN                               0x2
#define _LCDDATA16_S02C2_POSITION                           0x2
#define _LCDDATA16_S02C2_SIZE                               0x1
#define _LCDDATA16_S02C2_LENGTH                             0x1
#define _LCDDATA16_S02C2_MASK                               0x4
#define _LCDDATA16_S03C2_POSN                               0x3
#define _LCDDATA16_S03C2_POSITION                           0x3
#define _LCDDATA16_S03C2_SIZE                               0x1
#define _LCDDATA16_S03C2_LENGTH                             0x1
#define _LCDDATA16_S03C2_MASK                               0x8
#define _LCDDATA16_S04C2_POSN                               0x4
#define _LCDDATA16_S04C2_POSITION                           0x4
#define _LCDDATA16_S04C2_SIZE                               0x1
#define _LCDDATA16_S04C2_LENGTH                             0x1
#define _LCDDATA16_S04C2_MASK                               0x10
#define _LCDDATA16_S05C2_POSN                               0x5
#define _LCDDATA16_S05C2_POSITION                           0x5
#define _LCDDATA16_S05C2_SIZE                               0x1
#define _LCDDATA16_S05C2_LENGTH                             0x1
#define _LCDDATA16_S05C2_MASK                               0x20
#define _LCDDATA16_S06C2_POSN                               0x6
#define _LCDDATA16_S06C2_POSITION                           0x6
#define _LCDDATA16_S06C2_SIZE                               0x1
#define _LCDDATA16_S06C2_LENGTH                             0x1
#define _LCDDATA16_S06C2_MASK                               0x40
#define _LCDDATA16_S07C2_POSN                               0x7
#define _LCDDATA16_S07C2_POSITION                           0x7
#define _LCDDATA16_S07C2_SIZE                               0x1
#define _LCDDATA16_S07C2_LENGTH                             0x1
#define _LCDDATA16_S07C2_MASK                               0x80
#define _LCDDATA16_T4CKPS016_POSN                           0x0
#define _LCDDATA16_T4CKPS016_POSITION                       0x0
#define _LCDDATA16_T4CKPS016_SIZE                           0x1
#define _LCDDATA16_T4CKPS016_LENGTH                         0x1
#define _LCDDATA16_T4CKPS016_MASK                           0x1
#define _LCDDATA16_T4CKPS116_POSN                           0x1
#define _LCDDATA16_T4CKPS116_POSITION                       0x1
#define _LCDDATA16_T4CKPS116_SIZE                           0x1
#define _LCDDATA16_T4CKPS116_LENGTH                         0x1
#define _LCDDATA16_T4CKPS116_MASK                           0x2
#define _LCDDATA16_T4OUTPS016_POSN                          0x3
#define _LCDDATA16_T4OUTPS016_POSITION                      0x3
#define _LCDDATA16_T4OUTPS016_SIZE                          0x1
#define _LCDDATA16_T4OUTPS016_LENGTH                        0x1
#define _LCDDATA16_T4OUTPS016_MASK                          0x8
#define _LCDDATA16_T4OUTPS116_POSN                          0x4
#define _LCDDATA16_T4OUTPS116_POSITION                      0x4
#define _LCDDATA16_T4OUTPS116_SIZE                          0x1
#define _LCDDATA16_T4OUTPS116_LENGTH                        0x1
#define _LCDDATA16_T4OUTPS116_MASK                          0x10
#define _LCDDATA16_T4OUTPS216_POSN                          0x5
#define _LCDDATA16_T4OUTPS216_POSITION                      0x5
#define _LCDDATA16_T4OUTPS216_SIZE                          0x1
#define _LCDDATA16_T4OUTPS216_LENGTH                        0x1
#define _LCDDATA16_T4OUTPS216_MASK                          0x20
#define _LCDDATA16_T4OUTPS316_POSN                          0x6
#define _LCDDATA16_T4OUTPS316_POSITION                      0x6
#define _LCDDATA16_T4OUTPS316_SIZE                          0x1
#define _LCDDATA16_T4OUTPS316_LENGTH                        0x1
#define _LCDDATA16_T4OUTPS316_MASK                          0x40

