MikroElektronika/core_packages/PIC/XC8/def/PIC18F66J99/mcu.h
extern volatile __bit                   TRISD1              __at(0x7CA9);	// @ (0xF95 * 8 + 1)
#define                                 TRISD1_bit          _BIT_ACCESS(TRISD,1)
// TRISD<TRISD2>
extern volatile __bit                   TRISD2              __at(0x7CAA);	// @ (0xF95 * 8 + 2)
#define                                 TRISD2_bit          _BIT_ACCESS(TRISD,2)
// TRISD<TRISD3>
extern volatile __bit                   TRISD3              __at(0x7CAB);	// @ (0xF95 * 8 + 3)
#define                                 TRISD3_bit          _BIT_ACCESS(TRISD,3)
// TRISD<TRISD4>
extern volatile __bit                   TRISD4              __at(0x7CAC);	// @ (0xF95 * 8 + 4)
#define                                 TRISD4_bit          _BIT_ACCESS(TRISD,4)
// TRISD<TRISD5>
extern volatile __bit                   TRISD5              __at(0x7CAD);	// @ (0xF95 * 8 + 5)
#define                                 TRISD5_bit          _BIT_ACCESS(TRISD,5)
// TRISD<TRISD6>
extern volatile __bit                   TRISD6              __at(0x7CAE);	// @ (0xF95 * 8 + 6)
#define                                 TRISD6_bit          _BIT_ACCESS(TRISD,6)
// TRISD<TRISD7>
extern volatile __bit                   TRISD7              __at(0x7CAF);	// @ (0xF95 * 8 + 7)
#define                                 TRISD7_bit          _BIT_ACCESS(TRISD,7)
// TRISE<TRISE0>
extern volatile __bit                   TRISE0              __at(0x7CB0);	// @ (0xF96 * 8 + 0)
#define                                 TRISE0_bit          _BIT_ACCESS(TRISE,0)
// TRISE<TRISE1>
extern volatile __bit                   TRISE1              __at(0x7CB1);	// @ (0xF96 * 8 + 1)
#define                                 TRISE1_bit          _BIT_ACCESS(TRISE,1)
// TRISE<TRISE2>
extern volatile __bit                   TRISE2              __at(0x7CB2);	// @ (0xF96 * 8 + 2)
#define                                 TRISE2_bit          _BIT_ACCESS(TRISE,2)
// TRISE<TRISE3>
extern volatile __bit                   TRISE3              __at(0x7CB3);	// @ (0xF96 * 8 + 3)
#define                                 TRISE3_bit          _BIT_ACCESS(TRISE,3)
// TRISE<TRISE4>
extern volatile __bit                   TRISE4              __at(0x7CB4);	// @ (0xF96 * 8 + 4)
#define                                 TRISE4_bit          _BIT_ACCESS(TRISE,4)
// TRISE<TRISE5>
extern volatile __bit                   TRISE5              __at(0x7CB5);	// @ (0xF96 * 8 + 5)
#define                                 TRISE5_bit          _BIT_ACCESS(TRISE,5)
// TRISE<TRISE6>
extern volatile __bit                   TRISE6              __at(0x7CB6);	// @ (0xF96 * 8 + 6)
#define                                 TRISE6_bit          _BIT_ACCESS(TRISE,6)
// TRISE<TRISE7>
extern volatile __bit                   TRISE7              __at(0x7CB7);	// @ (0xF96 * 8 + 7)
#define                                 TRISE7_bit          _BIT_ACCESS(TRISE,7)
// TRISF<TRISF2>
extern volatile __bit                   TRISF2              __at(0x7CBA);	// @ (0xF97 * 8 + 2)
#define                                 TRISF2_bit          _BIT_ACCESS(TRISF,2)
// TRISF<TRISF3>
extern volatile __bit                   TRISF3              __at(0x7CBB);	// @ (0xF97 * 8 + 3)
#define                                 TRISF3_bit          _BIT_ACCESS(TRISF,3)
// TRISF<TRISF4>
extern volatile __bit                   TRISF4              __at(0x7CBC);	// @ (0xF97 * 8 + 4)
#define                                 TRISF4_bit          _BIT_ACCESS(TRISF,4)
// TRISF<TRISF5>
extern volatile __bit                   TRISF5              __at(0x7CBD);	// @ (0xF97 * 8 + 5)
#define                                 TRISF5_bit          _BIT_ACCESS(TRISF,5)
// TRISF<TRISF6>
extern volatile __bit                   TRISF6              __at(0x7CBE);	// @ (0xF97 * 8 + 6)
#define                                 TRISF6_bit          _BIT_ACCESS(TRISF,6)
// TRISF<TRISF7>
extern volatile __bit                   TRISF7              __at(0x7CBF);	// @ (0xF97 * 8 + 7)
#define                                 TRISF7_bit          _BIT_ACCESS(TRISF,7)
// TRISG<TRISG0>
extern volatile __bit                   TRISG0              __at(0x7CC0);	// @ (0xF98 * 8 + 0)
#define                                 TRISG0_bit          _BIT_ACCESS(TRISG,0)
// TRISG<TRISG1>
extern volatile __bit                   TRISG1              __at(0x7CC1);	// @ (0xF98 * 8 + 1)
#define                                 TRISG1_bit          _BIT_ACCESS(TRISG,1)
// TRISG<TRISG2>
extern volatile __bit                   TRISG2              __at(0x7CC2);	// @ (0xF98 * 8 + 2)
#define                                 TRISG2_bit          _BIT_ACCESS(TRISG,2)
// TRISG<TRISG3>
extern volatile __bit                   TRISG3              __at(0x7CC3);	// @ (0xF98 * 8 + 3)
#define                                 TRISG3_bit          _BIT_ACCESS(TRISG,3)
// TRISG<TRISG4>
extern volatile __bit                   TRISG4              __at(0x7CC4);	// @ (0xF98 * 8 + 4)
#define                                 TRISG4_bit          _BIT_ACCESS(TRISG,4)
// TRISVP<TRISVP0>
extern volatile __bit                   TRISVP0             __at(0x7B98);	// @ (0xF73 * 8 + 0)
#define                                 TRISVP0_bit         _BIT_ACCESS(TRISVP,0)
// TRISVP<TRISVP1>
extern volatile __bit                   TRISVP1             __at(0x7B99);	// @ (0xF73 * 8 + 1)
#define                                 TRISVP1_bit         _BIT_ACCESS(TRISVP,1)
// TRISVP<TRISVP2>
extern volatile __bit                   TRISVP2             __at(0x7B9A);	// @ (0xF73 * 8 + 2)
#define                                 TRISVP2_bit         _BIT_ACCESS(TRISVP,2)
// TRISVP<TRISVP3>
extern volatile __bit                   TRISVP3             __at(0x7B9B);	// @ (0xF73 * 8 + 3)
#define                                 TRISVP3_bit         _BIT_ACCESS(TRISVP,3)
// TRISVP<TRISVP4>
extern volatile __bit                   TRISVP4             __at(0x7B9C);	// @ (0xF73 * 8 + 4)
#define                                 TRISVP4_bit         _BIT_ACCESS(TRISVP,4)
// TRISVP<TRISVP5>
extern volatile __bit                   TRISVP5             __at(0x7B9D);	// @ (0xF73 * 8 + 5)
#define                                 TRISVP5_bit         _BIT_ACCESS(TRISVP,5)
// TRISVP<TRISVP6>
extern volatile __bit                   TRISVP6             __at(0x7B9E);	// @ (0xF73 * 8 + 6)
#define                                 TRISVP6_bit         _BIT_ACCESS(TRISVP,6)
// TRISVP<TRISVP7>
extern volatile __bit                   TRISVP7             __at(0x7B9F);	// @ (0xF73 * 8 + 7)
#define                                 TRISVP7_bit         _BIT_ACCESS(TRISVP,7)
// TXSTA1<TRMT1>
extern volatile __bit                   TRMT1               __at(0x7D61);	// @ (0xFAC * 8 + 1)
#define                                 TRMT1_bit           _BIT_ACCESS(TXSTA1,1)
// UIE<TRNIE>
extern volatile __bit                   TRNIE               __at(0x7083);	// @ (0xE10 * 8 + 3)
#define                                 TRNIE_bit           _BIT_ACCESS(UIE,3)
// UIR<TRNIF>
extern volatile __bit                   TRNIF               __at(0x7BC3);	// @ (0xF78 * 8 + 3)
#define                                 TRNIF_bit           _BIT_ACCESS(UIR,3)
// OSCTUNE<TUN0>
extern volatile __bit                   TUN0                __at(0x7CD8);	// @ (0xF9B * 8 + 0)
#define                                 TUN0_bit            _BIT_ACCESS(OSCTUNE,0)
// OSCTUNE<TUN1>
extern volatile __bit                   TUN1                __at(0x7CD9);	// @ (0xF9B * 8 + 1)
#define                                 TUN1_bit            _BIT_ACCESS(OSCTUNE,1)
// OSCTUNE<TUN2>
extern volatile __bit                   TUN2                __at(0x7CDA);	// @ (0xF9B * 8 + 2)
#define                                 TUN2_bit            _BIT_ACCESS(OSCTUNE,2)
// OSCTUNE<TUN3>
extern volatile __bit                   TUN3                __at(0x7CDB);	// @ (0xF9B * 8 + 3)
#define                                 TUN3_bit            _BIT_ACCESS(OSCTUNE,3)
// OSCTUNE<TUN4>
extern volatile __bit                   TUN4                __at(0x7CDC);	// @ (0xF9B * 8 + 4)
#define                                 TUN4_bit            _BIT_ACCESS(OSCTUNE,4)
// OSCTUNE<TUN5>
extern volatile __bit                   TUN5                __at(0x7CDD);	// @ (0xF9B * 8 + 5)
#define                                 TUN5_bit            _BIT_ACCESS(OSCTUNE,5)
// PIE1<TX1IE>
extern volatile __bit                   TX1IE               __at(0x7CEC);	// @ (0xF9D * 8 + 4)
#define                                 TX1IE_bit           _BIT_ACCESS(PIE1,4)
// PIR1<TX1IF>
extern volatile __bit                   TX1IF               __at(0x7CF4);	// @ (0xF9E * 8 + 4)
#define                                 TX1IF_bit           _BIT_ACCESS(PIR1,4)
// IPR1<TX1IP>
extern volatile __bit                   TX1IP               __at(0x7CFC);	// @ (0xF9F * 8 + 4)
#define                                 TX1IP_bit           _BIT_ACCESS(IPR1,4)
// PIE3<TX2IE>
extern volatile __bit                   TX2IE               __at(0x7D1C);	// @ (0xFA3 * 8 + 4)
#define                                 TX2IE_bit           _BIT_ACCESS(PIE3,4)
// PIR3<TX2IF>
extern volatile __bit                   TX2IF               __at(0x7D24);	// @ (0xFA4 * 8 + 4)
#define                                 TX2IF_bit           _BIT_ACCESS(PIR3,4)
// IPR3<TX2IP>
extern volatile __bit                   TX2IP               __at(0x7D2C);	// @ (0xFA5 * 8 + 4)
#define                                 TX2IP_bit           _BIT_ACCESS(IPR3,4)
// PIE6<TX3IE>
extern volatile __bit                   TX3IE               __at(0x7B0C);	// @ (0xF61 * 8 + 4)
#define                                 TX3IE_bit           _BIT_ACCESS(PIE6,4)
// PIR6<TX3IF>
extern volatile __bit                   TX3IF               __at(0x7D34);	// @ (0xFA6 * 8 + 4)
#define                                 TX3IF_bit           _BIT_ACCESS(PIR6,4)
// IPR6<TX3IP>
extern volatile __bit                   TX3IP               __at(0x7D4C);	// @ (0xFA9 * 8 + 4)
#define                                 TX3IP_bit           _BIT_ACCESS(IPR6,4)
// PIE6<TX4IE>
extern volatile __bit                   TX4IE               __at(0x7B0E);	// @ (0xF61 * 8 + 6)
#define                                 TX4IE_bit           _BIT_ACCESS(PIE6,6)
// PIR6<TX4IF>
extern volatile __bit                   TX4IF               __at(0x7D36);	// @ (0xFA6 * 8 + 6)
#define                                 TX4IF_bit           _BIT_ACCESS(PIR6,6)
// IPR6<TX4IP>
extern volatile __bit                   TX4IP               __at(0x7D4E);	// @ (0xFA9 * 8 + 6)
#define                                 TX4IP_bit           _BIT_ACCESS(IPR6,6)
// TXSTA1<TX8_9>
extern volatile __bit                   TX8_9               __at(0x7D66);	// @ (0xFAC * 8 + 6)
#define                                 TX8_9_bit           _BIT_ACCESS(TXSTA1,6)
// TXSTA2<TX8_92>
extern volatile __bit                   TX8_92              __at(0x7996);	// @ (0xF32 * 8 + 6)
#define                                 TX8_92_bit          _BIT_ACCESS(TXSTA2,6)
// TXSTA3<TX8_93>
extern volatile __bit                   TX8_93              __at(0x7976);	// @ (0xF2E * 8 + 6)
#define                                 TX8_93_bit          _BIT_ACCESS(TXSTA3,6)
// TXSTA4<TX8_94>
extern volatile __bit                   TX8_94              __at(0x77F6);	// @ (0xEFE * 8 + 6)
#define                                 TX8_94_bit          _BIT_ACCESS(TXSTA4,6)
// TXSTA1<TX91>
extern volatile __bit                   TX91                __at(0x7D66);	// @ (0xFAC * 8 + 6)
#define                                 TX91_bit            _BIT_ACCESS(TXSTA1,6)
// TXSTA1<TX9D1>
extern volatile __bit                   TX9D1               __at(0x7D60);	// @ (0xFAC * 8 + 0)
#define                                 TX9D1_bit           _BIT_ACCESS(TXSTA1,0)
// TXADDRL<TXADDR0>
extern volatile __bit                   TXADDR0             __at(0x7B80);	// @ (0xF70 * 8 + 0)
#define                                 TXADDR0_bit         _BIT_ACCESS(TXADDRL,0)
// TXADDRL<TXADDR1>
extern volatile __bit                   TXADDR1             __at(0x7B81);	// @ (0xF70 * 8 + 1)
#define                                 TXADDR1_bit         _BIT_ACCESS(TXADDRL,1)
// TXADDRH<TXADDR10>
extern volatile __bit                   TXADDR10            __at(0x7B7A);	// @ (0xF6F * 8 + 2)
#define                                 TXADDR10_bit        _BIT_ACCESS(TXADDRH,2)
// TXADDRH<TXADDR11>
extern volatile __bit                   TXADDR11            __at(0x7B7B);	// @ (0xF6F * 8 + 3)
#define                                 TXADDR11_bit        _BIT_ACCESS(TXADDRH,3)
// TXADDRL<TXADDR2>
extern volatile __bit                   TXADDR2             __at(0x7B82);	// @ (0xF70 * 8 + 2)
#define                                 TXADDR2_bit         _BIT_ACCESS(TXADDRL,2)
// TXADDRL<TXADDR3>
extern volatile __bit                   TXADDR3             __at(0x7B83);	// @ (0xF70 * 8 + 3)
#define                                 TXADDR3_bit         _BIT_ACCESS(TXADDRL,3)
// TXADDRL<TXADDR4>
extern volatile __bit                   TXADDR4             __at(0x7B84);	// @ (0xF70 * 8 + 4)
#define                                 TXADDR4_bit         _BIT_ACCESS(TXADDRL,4)
// TXADDRL<TXADDR5>
extern volatile __bit                   TXADDR5             __at(0x7B85);	// @ (0xF70 * 8 + 5)
#define                                 TXADDR5_bit         _BIT_ACCESS(TXADDRL,5)
// TXADDRL<TXADDR6>
extern volatile __bit                   TXADDR6             __at(0x7B86);	// @ (0xF70 * 8 + 6)
#define                                 TXADDR6_bit         _BIT_ACCESS(TXADDRL,6)
// TXADDRL<TXADDR7>
extern volatile __bit                   TXADDR7             __at(0x7B87);	// @ (0xF70 * 8 + 7)
#define                                 TXADDR7_bit         _BIT_ACCESS(TXADDRL,7)
// TXADDRH<TXADDR8>
extern volatile __bit                   TXADDR8             __at(0x7B78);	// @ (0xF6F * 8 + 0)
#define                                 TXADDR8_bit         _BIT_ACCESS(TXADDRH,0)
// TXADDRH<TXADDR9>
extern volatile __bit                   TXADDR9             __at(0x7B79);	// @ (0xF6F * 8 + 1)
#define                                 TXADDR9_bit         _BIT_ACCESS(TXADDRH,1)
// PIE3<TXB0IE>
extern volatile __bit                   TXB0IE              __at(0x7D1A);	// @ (0xFA3 * 8 + 2)
#define                                 TXB0IE_bit          _BIT_ACCESS(PIE3,2)
// PIE3<TXB1IE>
extern volatile __bit                   TXB1IE              __at(0x7D1B);	// @ (0xFA3 * 8 + 3)
#define                                 TXB1IE_bit          _BIT_ACCESS(PIE3,3)
// PIE3<TXB2IE>
extern volatile __bit                   TXB2IE              __at(0x7D1C);	// @ (0xFA3 * 8 + 4)
#define                                 TXB2IE_bit          _BIT_ACCESS(PIE3,4)
// PIE3<TXBNIE>
extern volatile __bit                   TXBNIE              __at(0x7D1C);	// @ (0xFA3 * 8 + 4)
#define                                 TXBNIE_bit          _BIT_ACCESS(PIE3,4)
// PIR3<TXBNIF>
extern volatile __bit                   TXBNIF              __at(0x7D24);	// @ (0xFA4 * 8 + 4)
#define                                 TXBNIF_bit          _BIT_ACCESS(PIR3,4)
// IPR3<TXBNIP>
extern volatile __bit                   TXBNIP              __at(0x7D2C);	// @ (0xFA5 * 8 + 4)
#define                                 TXBNIP_bit          _BIT_ACCESS(IPR3,4)
// TXBUF<TXBUF0>
extern volatile __bit                   TXBUF0              __at(0x7B50);	// @ (0xF6A * 8 + 0)
#define                                 TXBUF0_bit          _BIT_ACCESS(TXBUF,0)
// TXBUF<TXBUF1>
extern volatile __bit                   TXBUF1              __at(0x7B51);	// @ (0xF6A * 8 + 1)
#define                                 TXBUF1_bit          _BIT_ACCESS(TXBUF,1)
// TXBUF<TXBUF2>
extern volatile __bit                   TXBUF2              __at(0x7B52);	// @ (0xF6A * 8 + 2)
#define                                 TXBUF2_bit          _BIT_ACCESS(TXBUF,2)
// TXBUF<TXBUF3>
extern volatile __bit                   TXBUF3              __at(0x7B53);	// @ (0xF6A * 8 + 3)
#define                                 TXBUF3_bit          _BIT_ACCESS(TXBUF,3)
// TXBUF<TXBUF4>
extern volatile __bit                   TXBUF4              __at(0x7B54);	// @ (0xF6A * 8 + 4)
#define                                 TXBUF4_bit          _BIT_ACCESS(TXBUF,4)
// TXBUF<TXBUF5>
extern volatile __bit                   TXBUF5              __at(0x7B55);	// @ (0xF6A * 8 + 5)
#define                                 TXBUF5_bit          _BIT_ACCESS(TXBUF,5)
// TXBUF<TXBUF6>
extern volatile __bit                   TXBUF6              __at(0x7B56);	// @ (0xF6A * 8 + 6)
#define                                 TXBUF6_bit          _BIT_ACCESS(TXBUF,6)
// TXBUF<TXBUF7>
extern volatile __bit                   TXBUF7              __at(0x7B57);	// @ (0xF6A * 8 + 7)
#define                                 TXBUF7_bit          _BIT_ACCESS(TXBUF,7)
// BAUDCON1<TXCKP1>
extern volatile __bit                   TXCKP1              __at(0x7B3C);	// @ (0xF67 * 8 + 4)
#define                                 TXCKP1_bit          _BIT_ACCESS(BAUDCON1,4)
// BAUDCON2<TXCKP2>
extern volatile __bit                   TXCKP2              __at(0x798C);	// @ (0xF31 * 8 + 4)
#define                                 TXCKP2_bit          _BIT_ACCESS(BAUDCON2,4)
// BAUDCON3<TXCKP3>
extern volatile __bit                   TXCKP3              __at(0x796C);	// @ (0xF2D * 8 + 4)
#define                                 TXCKP3_bit          _BIT_ACCESS(BAUDCON3,4)
// BAUDCON4<TXCKP4>
extern volatile __bit                   TXCKP4              __at(0x77EC);	// @ (0xEFD * 8 + 4)
#define                                 TXCKP4_bit          _BIT_ACCESS(BAUDCON4,4)
// TXSTA1<TXD8>
extern volatile __bit                   TXD8                __at(0x7D60);	// @ (0xFAC * 8 + 0)
#define                                 TXD8_bit            _BIT_ACCESS(TXSTA1,0)
// TXSTA2<TXD82>
extern volatile __bit                   TXD82               __at(0x7990);	// @ (0xF32 * 8 + 0)
#define                                 TXD82_bit           _BIT_ACCESS(TXSTA2,0)
// TXSTA3<TXD83>
extern volatile __bit                   TXD83               __at(0x7970);	// @ (0xF2E * 8 + 0)
#define                                 TXD83_bit           _BIT_ACCESS(TXSTA3,0)
// TXSTA4<TXD84>
extern volatile __bit                   TXD84               __at(0x77F0);	// @ (0xEFE * 8 + 0)
#define                                 TXD84_bit           _BIT_ACCESS(TXSTA4,0)
// TXSTA1<TXEN1>
extern volatile __bit                   TXEN1               __at(0x7D65);	// @ (0xFAC * 8 + 5)
#define                                 TXEN1_bit           _BIT_ACCESS(TXSTA1,5)
// PIE1<TXIE>
extern volatile __bit                   TXIE                __at(0x7CEC);	// @ (0xF9D * 8 + 4)
#define                                 TXIE_bit            _BIT_ACCESS(PIE1,4)
// PIR1<TXIF>
extern volatile __bit                   TXIF                __at(0x7CF4);	// @ (0xF9E * 8 + 4)
#define                                 TXIF_bit            _BIT_ACCESS(PIR1,4)
// DMACON1<TXINC>
extern volatile __bit                   TXINC               __at(0x7B05);	// @ (0xF60 * 8 + 5)
#define                                 TXINC_bit           _BIT_ACCESS(DMACON1,5)
// PMD3<TXMMD>
extern volatile __bit                   TXMMD               __at(0x778F);	// @ (0xEF1 * 8 + 7)
#define                                 TXMMD_bit           _BIT_ACCESS(PMD3,7)
// RPINR0_1<U1RXR0>
extern volatile __bit                   U1RXR0              __at(0x7150);	// @ (0xE2A * 8 + 0)
#define                                 U1RXR0_bit          _BIT_ACCESS(RPINR0_1,0)
// RPINR0_1<U1RXR1>
extern volatile __bit                   U1RXR1              __at(0x7151);	// @ (0xE2A * 8 + 1)
#define                                 U1RXR1_bit          _BIT_ACCESS(RPINR0_1,1)
// RPINR0_1<U1RXR2>
extern volatile __bit                   U1RXR2              __at(0x7152);	// @ (0xE2A * 8 + 2)
#define                                 U1RXR2_bit          _BIT_ACCESS(RPINR0_1,2)
// RPINR0_1<U1RXR3>
extern volatile __bit                   U1RXR3              __at(0x7153);	// @ (0xE2A * 8 + 3)
#define                                 U1RXR3_bit          _BIT_ACCESS(RPINR0_1,3)
// RPINR0_1<U1TXR0>
extern volatile __bit                   U1TXR0              __at(0x7154);	// @ (0xE2A * 8 + 4)
#define                                 U1TXR0_bit          _BIT_ACCESS(RPINR0_1,4)
// RPINR0_1<U1TXR1>
extern volatile __bit                   U1TXR1              __at(0x7155);	// @ (0xE2A * 8 + 5)
#define                                 U1TXR1_bit          _BIT_ACCESS(RPINR0_1,5)
// RPINR0_1<U1TXR2>
extern volatile __bit                   U1TXR2              __at(0x7156);	// @ (0xE2A * 8 + 6)
#define                                 U1TXR2_bit          _BIT_ACCESS(RPINR0_1,6)
// RPINR0_1<U1TXR3>
extern volatile __bit                   U1TXR3              __at(0x7157);	// @ (0xE2A * 8 + 7)
#define                                 U1TXR3_bit          _BIT_ACCESS(RPINR0_1,7)
// RPINR2_3<U2RXR0>
extern volatile __bit                   U2RXR0              __at(0x7158);	// @ (0xE2B * 8 + 0)
#define                                 U2RXR0_bit          _BIT_ACCESS(RPINR2_3,0)
// RPINR2_3<U2RXR1>
extern volatile __bit                   U2RXR1              __at(0x7159);	// @ (0xE2B * 8 + 1)
#define                                 U2RXR1_bit          _BIT_ACCESS(RPINR2_3,1)
// RPINR2_3<U2RXR2>
extern volatile __bit                   U2RXR2              __at(0x715A);	// @ (0xE2B * 8 + 2)
#define                                 U2RXR2_bit          _BIT_ACCESS(RPINR2_3,2)
// RPINR2_3<U2RXR3>
extern volatile __bit                   U2RXR3              __at(0x715B);	// @ (0xE2B * 8 + 3)
#define                                 U2RXR3_bit          _BIT_ACCESS(RPINR2_3,3)
// RPINR2_3<U2TXR0>
extern volatile __bit                   U2TXR0              __at(0x715C);	// @ (0xE2B * 8 + 4)
#define                                 U2TXR0_bit          _BIT_ACCESS(RPINR2_3,4)
// RPINR2_3<U2TXR1>
extern volatile __bit                   U2TXR1              __at(0x715D);	// @ (0xE2B * 8 + 5)
#define                                 U2TXR1_bit          _BIT_ACCESS(RPINR2_3,5)
// RPINR2_3<U2TXR2>
extern volatile __bit                   U2TXR2              __at(0x715E);	// @ (0xE2B * 8 + 6)
#define                                 U2TXR2_bit          _BIT_ACCESS(RPINR2_3,6)
// RPINR2_3<U2TXR3>
extern volatile __bit                   U2TXR3              __at(0x715F);	// @ (0xE2B * 8 + 7)
#define                                 U2TXR3_bit          _BIT_ACCESS(RPINR2_3,7)
// RPINR4_5<U3RXR0>
extern volatile __bit                   U3RXR0              __at(0x7160);	// @ (0xE2C * 8 + 0)
#define                                 U3RXR0_bit          _BIT_ACCESS(RPINR4_5,0)
// RPINR4_5<U3RXR1>
extern volatile __bit                   U3RXR1              __at(0x7161);	// @ (0xE2C * 8 + 1)
#define                                 U3RXR1_bit          _BIT_ACCESS(RPINR4_5,1)
// RPINR4_5<U3RXR2>
extern volatile __bit                   U3RXR2              __at(0x7162);	// @ (0xE2C * 8 + 2)
#define                                 U3RXR2_bit          _BIT_ACCESS(RPINR4_5,2)
// RPINR4_5<U3RXR3>
extern volatile __bit                   U3RXR3              __at(0x7163);	// @ (0xE2C * 8 + 3)
#define                                 U3RXR3_bit          _BIT_ACCESS(RPINR4_5,3)
// RPINR4_5<U3TXR0>
extern volatile __bit                   U3TXR0              __at(0x7164);	// @ (0xE2C * 8 + 4)
#define                                 U3TXR0_bit          _BIT_ACCESS(RPINR4_5,4)
// RPINR4_5<U3TXR1>
extern volatile __bit                   U3TXR1              __at(0x7165);	// @ (0xE2C * 8 + 5)
#define                                 U3TXR1_bit          _BIT_ACCESS(RPINR4_5,5)
// RPINR4_5<U3TXR2>
extern volatile __bit                   U3TXR2              __at(0x7166);	// @ (0xE2C * 8 + 6)
#define                                 U3TXR2_bit          _BIT_ACCESS(RPINR4_5,6)
// RPINR4_5<U3TXR3>
